// ==UserScript==
// @name         勋章放大镜
// @namespace    http://tampermonkey.net/
// @version      2.1.1
// @description  泥潭勋章属性展示！
// @author       轶致
// @match        https://www.gamemale.com/wodexunzhang-showxunzhang.html*
// @match        https://www.gamemale.com/plugin.php?id=wodexunzhang%3Ashowxunzhang&fid=*
// @match        https://www.gamemale.com/plugin.php?id=wodexunzhang%3Ashowxunzhang&action=*
// @namespace    https://www.gamemale.com/forum.php?mod=viewthread&tid=129944
// @homepage     https://www.gamemale.com/thread-129944-1-1.html
// @grant        GM_getValue
// @grant        GM_setValue
// @grant        GM_registerMenuCommand
// @license GPL
// @downloadURL https://update.greasyfork.org/scripts/516559/%E5%8B%8B%E7%AB%A0%E6%94%BE%E5%A4%A7%E9%95%9C.user.js
// @updateURL   https://update.greasyfork.org/scripts/516559/%E5%8B%8B%E7%AB%A0%E6%94%BE%E5%A4%A7%E9%95%9C.meta.js
// @icon        https://www.gamemale.com/template/mwt2/extend/img/favicon.ico
// ==/UserScript==

// 捆绑销售 博物馆传送门 https://www.gamemale.com/thread-144398-1-1.html

// 脚本更新地址 https://greasyfork.org/zh-CN/scripts/516559/versions/new
// 脚本下载地址 https://greasyfork.org/zh-CN/scripts/516559-%E5%8B%8B%E7%AB%A0%E6%94%BE%E5%A4%A7%E9%95%9C

(function () {
    'use strict';
    // 0为原版【上下显示】 1为新版【左右显示】
    // 似乎手机上下显示没问题，那保留一下
    // 判断是否为移动设备（包括 iPhone）
    const isMobile = /Mobi|Android|iPhone/i.test(navigator.userAgent);

    if (GM_getValue("toggleSetting") === undefined) {
        // toggleSetting 代表放大镜是否位于标签左右 true为左右，false为上下
        GM_setValue("toggleSetting", !isMobile); // 如果是移动设备，默认为 false；否则为 true
    }

    // 创建菜单命令用于切换设置
    GM_registerMenuCommand("切换放大镜显示位置", toggleSettingFun);
    function toggleSettingFun() {
        const currentValue = GM_getValue("toggleSetting");
        const newValue = !currentValue;
        GM_setValue("toggleSetting", newValue);
    }

    // 此外右下角有一个放大器可以显示/隐藏放大镜，解决遮挡原信息问题
    // 估计很多人没法发现过这个东西
    let 放大镜显示 = localStorage.getItem('放大镜显示') !== 'false';

    function 创建控制面板() {
        const 控制面板 = document.createElement('div');
        控制面板.id = '控制面板';
        控制面板.style.position = 'fixed';
        控制面板.style.bottom = '20px';
        控制面板.style.right = '20px';
        控制面板.style.zIndex = '1000';
        控制面板.innerHTML = `<button id="切换放大镜按钮" style="font-size: 18px; background: none; border: none; padding: 0; box-shadow: none; line-height: 1;">${放大镜显示 ? "🔎✅" : "🔎🚫"}</button>`;
        document.body.appendChild(控制面板);
        document.getElementById("切换放大镜按钮").addEventListener("click", 切换放大镜显示);
    }

    function 切换放大镜显示() {
        放大镜显示 = !放大镜显示;
        this.innerHTML = 放大镜显示 ? "🔎✅" : "🔎🚫";
        localStorage.setItem('放大镜显示', 放大镜显示);
        if (!放大镜显示) {
            隐藏所有放大镜();
        }
    }

    function 创建放大镜() {
        const 放大镜 = document.createElement('div');
        放大镜.id = '泥潭勋章放大镜';
        放大镜.style.position = 'absolute';
        放大镜.style.padding = '10px';
        放大镜.style.background = 'white';
        放大镜.style.border = '1px solid black';
        放大镜.style.borderRadius = '5px';
        放大镜.style.display = 'none';
        放大镜.style.zIndex = '10000';
        放大镜.style.fontWeight = 'bold';
        放大镜.style.color = '#000516';
        document.body.appendChild(放大镜);
        return 放大镜;
    }

    const 放大镜 = 创建放大镜();

    const 收益权重映射 = {
        '金币': 1,
        '血液': 1,
        '旅程': 30,
        '咒术': 5,
        '知识': 50,
        '灵魂': 1000,
    };

    const 属性映射 = {
        '金币': { 颜色: '#ffd700', emoji: '💰' },
        '血液': { 颜色: '#ff0000', emoji: '🩸' },
        '旅程': { 颜色: '#008000', emoji: '✈️' },
        '咒术': { 颜色: '#a52a2a', emoji: '🔮' },
        '知识': { 颜色: '#0000ff', emoji: '📖' },
        '灵魂': { 颜色: '#add8e6', emoji: '✡️' },
        '总计': { 颜色: '#ffa500', emoji: '🈴' }
    };

    const 属性颜色映射 = {
        '回帖': '#0189ff',
        '发帖': 'purple'
    };

    function 计算收益(文本) {
        const 行列表 = 文本.split('\n');
        let 收益详情列表 = [];
        for (const 行 of 行列表) {
            let 总收益 = 0;
            let 行收益详情 = '';
            const 触发几率匹配 = 行.match(/】(\d+)%/);
            if (触发几率匹配) {
                const 触发几率 = parseFloat(触发几率匹配[1]) / 100;
                const 回帖属性匹配 = 行.match(/回帖(.*?)(,|$|发帖|升级|▕)/);
                if (回帖属性匹配) {
                    const 属性匹配 = [...回帖属性匹配[1].matchAll(/(金币|血液|旅程|咒术|知识|灵魂|堕落)(\+|-)(\d+)/g)];
                    let 匹配计数 = 0;
                    let 非堕落属性计数 = 0;
                    for (const 匹配 of 属性匹配) {
                        const 属性 = 匹配[1];
                        const 符号 = 匹配[2]; // '+' 或 '-'
                        const 值 = parseInt(匹配[3], 10) * (符号 === '+' ? 1 : -1);
                        if (属性 !== '堕落') {
                            非堕落属性计数++;
                            const 权重 = 收益权重映射[属性] || 0;
                            const 收益 = 触发几率 * 值 * 权重;
                            总收益 += 收益;
                            if (收益 !== 0) {
                                行收益详情 += `<span style="color:${属性映射[属性].颜色};">${属性映射[属性].emoji}${收益.toFixed(2)}</span> `;
                            }
                        }
                        匹配计数++;
                    }
                    if (非堕落属性计数 > 1) {
                        行收益详情 += ` <span style="color:${属性映射['总计'].颜色};">${属性映射['总计'].emoji}${总收益.toFixed(2)}</span>`;
                    }
                }
            }
            if (行收益详情 !== '') {
                收益详情列表.push(行收益详情.trim());
            } else {
                收益详情列表.push('');
            }
        }
        return 收益详情列表;
    }

    function 显示放大镜(内容, 目标) {
        if (!放大镜显示) return;
        const 收益详情列表 = 计算收益(内容);
        const 行列表 = 内容.split('\n');
        let 新内容 = '';
        for (let i = 0; i < 行列表.length; i++) {
            const 行 = 行列表[i];
            const 收益详情 = 收益详情列表[i];
            if (收益详情) {
                新内容 += 行.replace(/(】)(\d+)%(\s*)/, `$1${收益详情} $2%$3`);
            } else {
                新内容 += 行;
            }
            if (i < 行列表.length - 1) {
                新内容 += '\n';
            }
        }
        // 修改属性颜色
        新内容 = 新内容.replace(/(回帖)(.*?)(?=、|$|发帖|升级|▕)/g, function (match, p1, p2) {
            return `<span style="color:${属性颜色映射['回帖']}">${p1}${p2}</span>`;
        });
        新内容 = 新内容.replace(/(发帖)(.*?)(?=、|$|升级|▕)/g, function (match, p1, p2) {
            return `<span style="color:${属性颜色映射['发帖']}">${p1}${p2}</span>`;
        });
        放大镜.innerHTML = 新内容.replace(/\n/g, '<br>');
        放大镜.style.display = 'block';
        放大镜.style.visibility = 'hidden';

        if (GM_getValue("toggleSetting")) {
            定位放大镜New(目标)
        } else {
            定位放大镜(目标);
        }

        放大镜.style.visibility = 'visible';
    }

    function 定位放大镜(目标) {
        const 放大镜宽度 = 放大镜.offsetWidth;
        const 放大镜高度 = 放大镜.offsetHeight;
        const 目标矩形 = 目标.getBoundingClientRect();
        let 放大镜左边 = window.pageXOffset + 目标矩形.left - (放大镜宽度 / 2) + (目标矩形.width / 2);
        let 放大镜顶部 = window.pageYOffset + 目标矩形.top - 放大镜高度 - 10;

        if (放大镜顶部 < window.pageYOffset) {
            放大镜顶部 = window.pageYOffset + 目标矩形.bottom + 10;
        }
        if (放大镜左边 + 放大镜宽度 > window.pageXOffset + document.documentElement.clientWidth) {
            放大镜左边 = window.pageXOffset + document.documentElement.clientWidth - 放大镜宽度 - 10;
        }
        if (放大镜左边 < window.pageXOffset) {
            放大镜左边 = window.pageXOffset + 10;
        }
        if (放大镜顶部 + 放大镜高度 > window.pageYOffset + window.innerHeight) {
            放大镜顶部 = window.pageYOffset + 目标矩形.top - 放大镜高度 - 10;
        }
        放大镜.style.left = 放大镜左边 + 'px';
        放大镜.style.top = 放大镜顶部 + 'px';
    }

    function 定位放大镜New(img) {
        document.querySelectorAll(".MyshowTip2").forEach(label => {
            if (label.style.display != 'none') {
                const 放大镜宽度 = 放大镜.offsetWidth;
                const 放大镜高度 = 放大镜.offsetHeight;

                // 和原标签顶部对齐
                let 放大镜顶部 = parseInt(label.style.top)

                // 和原来标签的右对齐
                let 放大镜左边 = parseInt(label.style.left) + 200

                // 如果放不下就放左边
                if (放大镜左边 + 放大镜左边 > window.innerWidth) {
                    放大镜左边 = parseInt(label.style.left) - 放大镜宽度
                }
                // console.log(e.getBoundingClientRect())

                // 原来的标签太高了，直接溢出屏幕外（废弃）
                // 如果原标签在图片上方，从顶部对齐变成底部对齐
                const labelTop = label.getBoundingClientRect().top
                const imgTop = img.getBoundingClientRect().top
                const labelHeight = label.getBoundingClientRect().height
                // console.log(imgTop, labelTop)  
                if (labelTop < imgTop) {
                    放大镜顶部 = 放大镜顶部 + labelHeight - 放大镜高度
                }

                放大镜.style.top = 放大镜顶部 + 'px';
                放大镜.style.left = 放大镜左边 + 'px';
            }
        })

    }

    function 隐藏放大镜() {
        放大镜.style.display = 'none';
    }

    function 隐藏所有放大镜() {
        隐藏放大镜();
    }

    function 添加悬停监听器(目标, 放大镜内容) {
        目标.addEventListener('mouseover', function () {
            if (放大镜内容) {
                显示放大镜(放大镜内容, 目标);
            }
        });
        目标.addEventListener('mouseout', 隐藏放大镜);
    }

    function 初始化放大镜() {
        document.querySelectorAll('.myimg img').forEach(function (img) {
            const alt = img.getAttribute('alt');
            
            // 有的勋章是全角· 有的勋章是‧ 这里我们判断一下来保证匹配
            const alt1 = alt.replace(/·/g, '‧');
            const alt2 = alt.replace(/‧/g, '·');
            // 临时更新，真人男从勋章后面会带个.
            const alt3 = alt1.slice(0, -1)
            const alt4 = alt2.slice(0, -1)

            function getAlt(array) {
                return array.map(e => 放大镜内容映射表[e]).reduce((a, b) => a || b)
            }
            const altArray = [alt1, alt2, alt3, alt4]
            const 放大镜内容 = getAlt(altArray)

            if (放大镜内容) {
                添加悬停监听器(img, 放大镜内容);
            }
        });
    }
    function 变化检测() {
        const 观察 = new MutationObserver(function (变化标记) {
            变化标记.forEach(function (变化) {
                变化.addedNodes.forEach(function (节点) {
                    if (节点.nodeType === Node.ELEMENT_NODE && 节点.matches('.myimg img')) {
                        const 替代文本 = 节点.getAttribute('alt');
                        if (放大镜内容映射表.hasOwnProperty(替代文本)) {
                            添加悬停监听器(节点);
                        }
                    }
                });
            });
        });
        const 目标容器 = document.querySelector('.my_fenlei');
        if (目标容器) {
            观察.observe(目标容器, { childList: true, subtree: true });
        }
    }

    // Object.keys(放大镜内容映射表) 
    // 24.09.20 目前长度为448 男从165、女从23、装备52、资产66、宠物39、板块26、天赋12、故事10、剧情26、礼物13、咒术13 165+23+52+66+39+26+12+10+26+26=455
    // 不太可能纳入统计的 储蓄4 薪俸4 活动奖励79
    var 放大镜内容映射表 = {
'史莱姆蛋': `史莱姆蛋
【入手条件】发帖数≥30
【商店售价】220血液
【等级1】3% 回帖咒术+1▕▏升级条件：50金币
【等级2】6% 回帖咒术+1▕▏升级条件：75金币
【等级3】9% 回帖咒术+1▕▏升级条件：100金币
【 Max 】12% 回帖咒术+1、发帖金币+2`,
'迷のDoge': `迷のDoge
【入手条件】主题≥ 5
【商店售价】100金币
【等级1】2% 回帖血液+1 金币+1▕▏升级条件：50金币
【等级2】4% 回帖血液+1 金币+1▕▏升级条件：50金币
【 Max 】6% 回帖血液+1 金币+2 咒术+1`,
'洞窟魔蛋': `洞窟魔蛋
【入手条件】咒术≥40
【商店售价】1金币
【等级1】无属性▕▏升级条件：10血液
【等级2】5% 回帖咒术+1▕▏升级条件：30血液
【 Max 】14% 回帖咒术+2 血液-2、发帖咒术+2`,
'红龙蛋': `红龙蛋
【入手条件】血液≥200
【商店售价】150金币
【等级1】无属性▕▏升级条件：20血液左右（自动）
【等级2】2% 回帖血液+1 金币-1▕▏升级条件：250血液（自动）
【 Max 】10% 回帖血液+2 金币-1`,
'黑龙蛋': `黑龙蛋
【入手条件】咒术≥20
【商店售价】150金币
【等级1】无属性▕▏升级条件：10咒术（自动）
【等级2】2% 回帖咒术+1 金币-1▕▏升级条件：40咒术（自动）
【 Max 】10% 回帖咒术+1 金币-1`,
'腐化龙蛋': `腐化龙蛋
【入手条件】金币≥200
【商店售价】150金币
【等级1】无属性▕▏升级条件：10堕落（自动）
【等级2】2% 回帖金币+2 血液-1▕▏升级条件：40堕落（自动）
【 Max 】10% 回帖金币+2 血液-1`,
'漆黑的蝎卵': `漆黑的蝎卵
【入手条件】血液≥300
【商店售价】200金币
【等级1】4% 回帖咒术+1、发帖咒术+1▕▏升级条件：1灵魂（自动）
【 Max 】2% 回帖咒术+1、发帖灵魂+1`,
'【年中限定】GM村金蛋': `【年中限定】GM村金蛋
【入手条件】知识≥20
【商店售价】618金币
【等级1】1% 发帖金币+1▕▏升级条件：35知识
【等级2】12% 回帖金币+1、发帖金币+2▕▏升级条件：60知识
【 Max 】25% 回帖金币+2、发帖金币+4`,
'詹姆斯‧维加': `詹姆斯‧维加
【入手条件】无
【商店售价】450金币
【等级1】5% 发帖血液+1▕▏升级条件：20追随（自动）
【等级2】10% 回帖血液+1、发帖血液+1▕▏升级条件：55追随（自动）
【 Max 】15% 回帖血液+1、发帖血液+1`,
'奧倫': `奧倫
【入手条件】无
【商店售价】300金币
【等级1】无属性▕▏升级条件：50旅程
【等级2】10% 发帖金币+1▕▏升级条件：120旅程
【 Max 】20% 发帖金币+3`,
'希德‧海温特': `希德‧海温特
【入手条件】无
【商店售价】300金币
【等级3】8% 回帖金币+1▕▏升级条件：150金币
【 Max 】12% 回帖金币+2`,
'吉姆‧雷诺': `吉姆‧雷诺
【入手条件】无
【商店售价】350金币
【 Max 】12% 发帖旅程+1`,
'法卡斯': `法卡斯
【入手条件】无
【商店售价】300金币
【 Max 】10% 回帖血液+1 血液+1`,
'皮尔斯‧尼凡斯': `皮尔斯‧尼凡斯
【入手条件】无
【商店售价】400金币
【等级1】无属性▕▏升级条件：消耗50金币
【等级2】无属性▕▏升级条件：消耗50血液
【等级3】无属性▕▏升级条件：消耗50咒术
【 Max 】15% 回帖血液+2、发帖血液+2`,
'文森特‧瓦伦丁': `文森特‧瓦伦丁
【入手条件】无
【商店售价】350金币
【 Max 】10% 回帖咒术+1、发帖堕落+1`,
'巴尔弗雷亚': `巴尔弗雷亚
【入手条件】无
【商店售价】350金币
【等级1】4% 回帖金币+2、发帖金币+2▕▏升级条件：知识≥10
【等级2】8% 回帖金币+2、发帖金币+2▕▏升级条件：知识≥30
【 Max 】12% 回帖金币+2、发帖金币+2`,
'但丁': `但丁
【入手条件】无
【商店售价】450金币
【等级1】5% 发帖咒术+1▕▏升级条件：10血液
【等级2】8% 发帖咒术+1▕▏升级条件：10咒术
【等级3】10% 发帖咒术+2▕▏升级条件：1灵魂
【等级4】15% 发帖咒术+2▕▏升级条件：30咒术
【 Max 】20% 发帖咒术+3`,
'盖里': `盖里
【入手条件】无
【商店售价】420金币
【等级1】2% 发帖旅程+1▕▏升级条件：好友≥10
【等级2】5% 回帖血液+1、发帖旅程+1▕▏升级条件：好友≥30
【 Max 】7% 回帖血液+1 金币+1、发帖旅程+1`,
'梅格': `梅格
【入手条件】无
【商店售价】300金币
【等级1】5% 回帖堕落+1▕▏升级条件：追随≥22
【等级2】8% 回帖堕落+1▕▏升级条件：追随≥44
【 Max 】12% 回帖堕落+1 血液+1、发帖堕落+1 血液+1`,
'亚力斯塔尔': `亚力斯塔尔
【入手条件】无
【商店售价】450金币
【等级1】5% 发帖血液+2▕▏升级条件:发帖数≥200
【等级2】10% 发帖血液+2▕▏升级条件:发帖数≥500
【等级3】15% 发帖血液+2▕▏升级条件:消耗1灵魂
【 Max 】40% 发帖血液+3`,
'罗伯‧史塔克': `罗伯‧史塔克
【入手条件】堕落＜30
【商店售价】500金币
【等级1】1% 回帖金币+1 知识+1▕▏升级条件：10堕落。
【等级2】2% 回帖金币+1 知识+1▕▏升级条件：200金币
【等级3】5% 回帖金币+1、发帖旅程+1▕▏升级条件：35主题
【等级4】8% 回帖金币+1、发帖旅程+1▕▏升级条件：300血液
【等级5】10% 回帖金币+1、发帖旅程+1▕▏升级条件：300积分
【等级6】11% 回帖金币+1、发帖旅程+1 金币+3▕▏升级条件：500金币
【等级7】13% 回帖金币+2、发帖旅程+1 金币+3▕▏升级条件：700血液
【 Max 】20% 发帖金币+6 咒术+1`,
'亚当‧简森': `亚当‧简森
【入手条件】无
【商店售价】350金币
【等级1】5% 回帖金币+1 血液+1▕▏升级条件：消耗20咒术
【等级2】6% 回帖金币+1、发帖血液+2▕▏升级条件：知识≥15
【等级3】7% 回帖金币+2、发帖血液+3▕▏升级条件：消耗50咒术
【等级4】8% 回帖金币+2、发帖血液+4▕▏升级条件：知识≥45
【 Max 】9% 回帖金币+3、发帖血液+5`,
'布莱恩·欧康纳': `布莱恩·欧康纳
【入手条件】追随≥20
【商店售价】400金币
【等级1】4% 回帖金币+1▕▏升级条件：100金币
【等级2】6% 回帖金币+1▕▏升级条件：100血液
【等级3】8% 回帖金币+1▕▏升级条件：101追随
【 Max 】10% 回帖金币+2、发帖旅程+1`,
'迪恩·温彻斯特': `迪恩·温彻斯特
【入手条件】无
【商店售价】400金币
【等级1】2% 回帖血液+2、发帖血液+2▕▏升级条件：100血液
【等级3】6% 回帖血液+2、发帖血液+2▕▏升级条件：450血液
【等级4】8% 回帖血液+2、发帖血液+2▕▏升级条件：350金币
【 Max 】10% 回帖血液+2、发帖血液+2`,
'山姆·温彻斯特': `山姆·温彻斯特
【入手条件】无
【商店售价】400金币
【等级2】4% 回帖金币+2、发帖金币+2▕▏升级条件：50咒术
【等级3】6% 回帖金币+2、发帖金币+2▕▏升级条件：100咒术
【 Max 】10% 回帖金币+2、发帖金币+2`,
'魔术师奥斯卡': `魔术师奥斯卡
【入手条件】旅程≥10
【商店售价】490金币
【等级1】5% 回帖堕落+1▕▏升级条件：消耗30咒术
【等级2】6% 回帖堕落-1▕▏升级条件：消耗75咒术
【等级3】7% 回帖堕落+1▕▏升级条件：堕落≥20
【等级4】8% 回帖堕落-1、发帖知识+1▕▏升级条件：消耗120咒术
【等级5】9% 回帖堕落+1 咒术+1 发帖咒术+3 知识+1▕▏升级条件：咒术≥100
【 Max 】10% 回帖堕落-1 咒术+1、发帖 知识+1 咒术+3`,
'戴蒙‧萨尔瓦托': `戴蒙‧萨尔瓦托
【入手条件】堕落≥10
【商店售价】450金币
【等级1】5% 回帖血液+5 堕落+1、发帖血液+5 堕落+1▕▏升级条件：血液≥5
【等级2】无属性▕▏升级条件：血液≥20
【等级3】5% 回帖血液+1▕▏升级条件：血液≥50
【等级4】20% 回帖血液+1、发帖血液+3▕▏升级条件：血液≥55
【等级5】5% 回帖血液+1、发帖血液+3▕▏升级条件：血液≥100
【等级6】10% 回帖血液-1、发帖堕落+2 血液+2▕▏升级条件：血液≥108
【等级7】100% 回帖血液+2 堕落+1、发帖血液+2 堕落+1▕▏升级条件：血液≥110
【等级8】无属性▕▏升级条件：血液≥150
【等级9】2% 回帖血液-5 堕落+5、发帖灵魂+1▕▏升级条件：血液≥160
【等级10】20% 回帖血液-1 堕落+1▕▏升级条件：血液≥300
【 Max 】无属性`,
'库伦(起源)': `库伦(起源)
【入手条件】咒术≤25
【商店售价】480金币
【等级1】18% 回帖血液+2、发帖血液+6▕▏升级条件：11咒术
【 Max 】7% 发帖血液+8 咒术-1`,
'铁牛': `铁牛
【入手条件】无
【商店售价】400金币
【等级1】5% 回帖血液-1 金币+2▕▏升级条件：350血液
【等级2】7% 回帖血液-1 金币+2▕▏升级条件：200血液
【 Max 】13% 回帖血液-1 金币+3 堕落+1、发帖血液-1 金币+3 堕落+1`,
'康纳‧沃什': `康纳‧沃什
【入手条件】无
【商店售价】400金币
【等级1】5% 回帖血液+1▕▏升级条件：消耗50血液
【等级2】6% 回帖血液+1、发帖血液+1▕▏升级条件：堕落≥50
【等级3】7% 发帖知识+1 血液+1▕▏升级条件：知识≥50
【 Max 】8% 回帖堕落+1 血液+1、发帖知识+1 血液+1`,
'尼克·贝特曼': `尼克·贝特曼
【入手条件】无
【商店售价】500金币
【等级1】无属性▕▏升级条件：600血液。
【等级2】3% 发帖血液+3▕▏升级条件：600金
【等级3】5% 血液+3 咒术+2▕▏升级条件：900血液。
【等级4】7% 发帖血液+3 旅程+1▕▏升级条件：900金
【等级5】15% 血液+3 金币+2▕▏升级条件：1灵魂。
【 Max 】20% 发帖血液+4 金币+3`,
'杰夫‧莫罗': `杰夫‧莫罗
【入手条件】无
【商店售价】400金币
【等级2】3% 发帖知识+1▕▏升级条件：100血液
【等级3】3% 回帖知识+1、发帖知识+1▕▏升级条件：200血液
【等级4】5% 回帖知识+1、发帖知识+1▕▏升级条件：600金币
【 Max 】7% 回帖知识+1、发帖知识+1 旅程+1`,
'维吉尔': `维吉尔
【入手条件】无
【商店售价】400金币
【等级1】无属性▕▏升级条件：20血液
【等级2】无属性▕▏升级条件：80血液
【等级3】4% 回帖咒术+1、发帖咒术+1▕▏升级条件：堕落-10
【 Max 】6% 回帖咒术+1、发帖咒术+1 知识+1`,
'威尔卡斯': `威尔卡斯
【入手条件】无
【商店售价】400金币
【等级1】无属性▕▏升级条件：10血液
【等级2】无属性▕▏升级条件：30血液
【等级3】无属性▕▏升级条件：60血液
【 Max 】2% 发帖灵魂+1`,
'卡斯迪奥': `卡斯迪奥
【入手条件】堕落≤10
【商店售价】520金币
【等级1】2% 回帖堕落-1、发帖堕落-1▕▏升级条件：消耗50血液
【等级2】3% 回帖堕落-1、发帖堕落-1▕▏升级条件：消耗80血液
【等级3】4% 回帖堕落-1、发帖堕落-1 血液+1▕▏升级条件：消耗100血液
【等级4】5% 回帖堕落-1、发帖堕落-1 血液+1▕▏升级条件：消耗1灵魂
【等级5】无属性▕▏升级条件：堕落≥1
【等级6】2% 回帖血液+5 堕落-3、发帖灵魂+1 堕落-5▕▏升级条件：堕落≥16
【等级7】15% 回帖血液+2 堕落-1、发帖血液+3 堕落-3▕▏升级条件：堕落≥66
【等级8】15% 回帖金币+2 堕落+1、发帖金币+3 堕落+3▕▏升级条件：堕落≥116
【等级9】2% 回帖金币+5 堕落+3、发帖灵魂+1 堕落+5▕▏升级条件：堕落≥131
【 Max 】无属性`,
'虎克船长': `虎克船长
【入手条件】旅程≥15
【商店售价】320金币
【等级1】1% 发帖旅程+1▕▏升级条件：消耗200金币
【等级2】1% 回帖旅程+1、发帖旅程+1▕▏升级条件：消耗200血液
【等级3】2% 回帖旅程+1、发帖旅程+1▕▏升级条件：增加5堕落
【等级4】2% 回帖旅程+1、发帖旅程+1▕▏升级条件：增加10咒术
【等级5】3% 回帖旅程+1、发帖旅程+1▕▏升级条件：增加1知识
【 Max 】3% 回帖旅程+1、发帖旅程+1`,
'卢西亚诺‧科斯塔': `卢西亚诺‧科斯塔
【入手条件】无
【商店售价】370金币
【等级1】5% 回帖血液+1、发帖血液+1▕▏升级条件：100知识
【 Max 】30% 回帖血液+1、发帖血液+1`,
'安德森‧戴维斯': `安德森‧戴维斯
【入手条件】无
【商店售价】500金币
【等级1】2% 回帖血液+1、发帖咒术+1▕▏升级条件：5堕落
【等级2】4% 回帖血液+1、发帖咒术+1▕▏升级条件：10堕落
【等级3】6% 回帖血液+1、发帖咒术+1▕▏升级条件：25堕落
【等级4】8% 回帖血液+1、发帖咒术+1▕▏升级条件：50堕落
【 Max 】15% 回帖金币-1 咒术+1 血液+1、发帖咒术+2`,
'尤利西斯': `尤利西斯
【入手条件】无
【商店售价】250金币
【等级1】无属性▕▏升级条件：消耗200血液
【等级2】2% 回帖血液+1▕▏升级条件：获得10堕落
【等级3】7% 回帖金币+1▕▏升级条件：金币≥600
【 Max 】无属性`,
'克里斯‧雷德菲尔德': `克里斯‧雷德菲尔德
【入手条件】无
【商店售价】550金币
【等级1】3% 回帖血液+1、发帖血液+1▕▏升级条件：30血液
【等级2】3% 回帖血液+2、发帖血液+2▕▏升级条件：50追随
【等级3】4% 回帖血液+2、发帖血液+2 旅程+1▕▏升级条件：100追随
【 Max 】7% 回帖血液+2 旅程+1 金币+1、发帖血液+2 旅程+1`,
'裸体克里斯': `裸体克里斯
【入手条件】无
【商店售价】888金币
【 Max 】100% 回帖金币+1、发帖金币+1`,
'凯登‧阿兰科': `凯登‧阿兰科
【入手条件】无
【商店售价】550金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗20血液
【等级2】5% 回帖金币+1 血液+1▕▏升级条件：血液≥60
【等级3】7% 回帖金币+1 血液+1▕▏升级条件：消耗150金币
【等级4】10% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：灵魂≥1
【等级5】20% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：消耗800金币
【 Max 】50% 回帖金币+1 血液+1、发帖金币+3 血液+3`,
'肥皂': `肥皂
【入手条件】无
【商店售价】400金币
【等级1】无属性▕▏升级条件：消耗60金币
【等级2】3% 回帖金币+1、发帖金币+5▕▏升级条件：消耗150金币
【等级3】7% 回帖金币+1、发帖金币+5▕▏升级条件：追随≥50
【等级4】10% 回帖金币+1、发帖金币+5▕▏升级条件：追随≥80
【等级5】12% 回帖金币+1、发帖金币+5▕▏升级条件：金币-200
【 Max 】12% 回帖金币+2、发帖金币+5 旅程+1`,
'奥利弗·奎恩': `奥利弗·奎恩
【入手条件】堕落＜50
【商店售价】400金币
【等级1】5% 发帖血液+2▕▏升级条件：消耗40血液
【等级2】7% 发帖血液+2▕▏升级条件：消耗65血液
【等级3】9% 发帖血液+2▕▏升级条件：主题数≥15
【等级4】11% 回帖血液+1、发帖血液+2▕▏升级条件：追随≥45
【等级5】13% 回帖血液+1、发帖血液+2▕▏升级条件：30堕落
【等级6】13% 回帖血液+1、发帖血液+2▕▏升级条件：500血液
【 Max 】15% 回帖血液+1 堕落-1、发帖血液+2 堕落-3`,
'猫化弩哥': `猫化弩哥
【入手条件】堕落＞5
【商店售价】200金币
【 Max 】6% 发帖知识+1 咒术+1`,
'史蒂夫‧金克斯': `史蒂夫‧金克斯
【入手条件】无
【商店售价】230金币
【等级1】3% 回帖咒术+1、发帖咒术+1▕▏升级条件：咒术≥120
【 Max 】5% 回帖堕落+2、发帖堕落+2`,
'巴特‧贝克': `巴特‧贝克
【入手条件】堕落＜20
【商店售价】180金币
【等级1】2% 回帖堕落+1▕▏升级条件：20堕落
【等级2】4% 回帖堕落+1▕▏升级条件：50堕落
【 Max 】6% 回帖堕落+1 金币+1、发帖堕落+1 金币+1`,
'杰森·斯坦森': `杰森·斯坦森
【入手条件】无
【商店售价】490金币
【等级1】无属性▕▏升级条件：知识≥0
【等级2】1% 回帖血液+1▕▏升级条件：金币≥300
【等级3】5% 回帖血液+1、发帖血液+1▕▏升级条件：金币≥750
【等级4】10% 回帖堕落-1 血液+1、发帖堕落-1 血液+1▕▏升级条件：血液≥1000
【等级5】15% 回帖堕落-1 血液+2、发帖堕落-1 血液+2▕▏升级条件：消耗灵魂1
【 Max 】25% 回帖堕落-1 血液+2、发帖堕落-1 血液+2`,
'哈尔‧乔丹': `哈尔‧乔丹
【入手条件】无
【商店售价】550金币
【等级1】无属性▕▏升级条件：知识≥15
【等级2】2% 回帖咒术+1▕▏升级条件：追随≥75。
【等级3】5% 回帖咒术+1、发帖咒术+1▕▏升级条件：积分≥100
【 Max 】7% 回帖咒术+1、发帖咒术+1 旅程+1`,
'艾德尔': `艾德尔
【入手条件】无
【商店售价】280金币
【 Max 】8% 发帖血液+3 旅程+1`,
'盖拉斯·瓦卡瑞安': `盖拉斯·瓦卡瑞安
【入手条件】无
【商店售价】450金币
【等级1】5% 回帖金币+1、发帖金币+1▕▏升级条件：≥2灵魂
【 Max 】12% 回帖金币+1、发帖金币+2`,
'戴尔‧芭芭拉': `戴尔‧芭芭拉
【入手条件】无
【商店售价】280金币
【等级1】无属性▕▏升级条件：250血液
【等级2】3% 发帖堕落+1▕▏升级条件：10堕落
【 Max 】3% 回帖堕落-1 血液+1、发帖旅程+1`,
'Frank (LBF)': `Frank (LBF)
【入手条件】无
【商店售价】270金币
【等级1】3% 回帖血液+1▕▏升级条件：10主题数
【等级2】6% 回帖血液+1▕▏升级条件：30追随
【等级3】10% 回帖血液+1▕▏升级条件：90旅程
【 Max 】10% 回帖血液+1 堕落-1、发帖旅程+1`,
'BIG BOSS': `BIG BOSS
【入手条件】无
【商店售价】600金币
【等级1】3% 回帖堕落+1、发帖堕落+1▕▏升级条件：500血液
【等级2】5% 回帖金币+1 堕落+1、发帖堕落+1▕▏升级条件：1灵魂
【等级3】10% 回帖金币+1 堕落+1、发帖堕落+1▕▏升级条件：1000金币
【 Max 】20% 回帖金币+1 血液+1、发帖金币+3 血液+3`,
'詹米·多南': `詹米·多南
【入手条件】无
【商店售价】320金币
【等级1】5% 回帖血液+1 堕落+1、发帖血液+2 堕落+1▕▏升级条件：60咒术
【 Max 】10% 回帖血液+1 堕落+1、发帖血液+2 堕落+1`,
'阿尔萨斯‧米奈希尔': `阿尔萨斯‧米奈希尔
【入手条件】无
【商店售价】350金币
【等级1】7% 回帖堕落+1、发帖咒术+2▕▏升级条件：堕落≥50
【 Max 】15% 回帖血液+1、发帖咒术+2`,
'克里斯·埃文斯': `克里斯·埃文斯
【入手条件】无
【商店售价】300金币
【等级1】2% 回帖血液+1、发帖血液+1▕▏升级条件：追随≥50
【等级2】3% 回帖血液+2、发帖血液+2▕▏升级条件：消耗300金币
【 Max 】5% 回帖血液+2 旅程+1、发帖血液+2 旅程+1`,
'安德鲁·库珀': `安德鲁·库珀
【入手条件】无
【商店售价】400金币
【等级1】2% 回帖金币+1 血液-1▕▏升级条件：200血液
【等级2】5% 回帖金币+2 血液-1▕▏升级条件：300血液
【 Max 】10% 回帖金币+3 血液-1、发帖金币+3 血液-1`,
'罗宾·西克': `罗宾·西克
【入手条件】无
【商店售价】300金币
【等级1】5% 回帖堕落+1▕▏升级条件：堕落≥20
【等级2】5% 回帖堕落+2▕▏升级条件：堕落≥50
【等级3】10% 回帖堕落+2 血液-1▕▏升级条件：消耗200血液
【 Max 】15% 回帖堕落-1 血液+2`,
'岛田半藏': `岛田半藏
【入手条件】无
【商店售价】500金币
【等级1】2% 回帖血液+1▕▏升级条件：10知识
【等级2】5% 回帖血液+1▕▏升级条件：25旅程
【等级3】5% 回帖金币+1 血液+1▕▏升级条件：100咒术
【 Max 】10% 回帖金币+1 咒术+1`,
'泰凯斯·芬得利': `泰凯斯·芬得利
【入手条件】追随>=10
【商店售价】320金币
【等级1】4% 回帖血液+1▕▏升级条件：血液≥100
【等级2】6% 回帖血液+1、发帖金币+1▕▏升级条件：消耗血液150
【等级3】8% 回帖血液+1、发帖金币+2▕▏升级条件：消耗金币200
【 Max 】8% 回帖血液+2、发帖金币+2 知识+1`,
'【夏日限定】夏日的泰凯斯': `【夏日限定】夏日的泰凯斯
【入手条件】堕落>=30
【商店售价】666金币
【等级1】5% 回帖堕落+1▕▏升级条件：堕落≥50
【等级2】10% 回帖堕落+1 血液+1▕▏升级条件：消耗200血液
【等级3】15% 回帖堕落+1 血液+2、发帖血液+3 堕落+1▕▏升级条件：消耗200金币
【 Max 】20% 回帖金币-1 血液+3 堕落+1、发帖血液+5 堕落+1`,
'康纳': `康纳
【入手条件】无
【商店售价】400金币
【等级1】2% 回帖金币+1▕▏升级条件：消耗75金币
【等级2】4% 回帖金币+1▕▏升级条件：消耗75血液
【等级3】6% 回帖金币+1、发帖金币+1▕▏升级条件：消耗250金币
【等级4】8% 回帖金币+1、发帖金币+1 血液+1▕▏升级条件：消耗250血液
【等级5】8% 回帖金币+1 血液+1、发帖 金币+1、血液+1▕▏升级条件：追随≥50
【 Max 】12% 回帖金币+2、发帖金币+3 旅程+1 血液+1`,
'亚瑟·库瑞（海王）': `亚瑟·库瑞（海王）
【入手条件】咒术≤40
【商店售价】450金币
【等级1】2% 回帖血液+1▕▏升级条件：旅程≥30
【等级2】3% 回帖血液+1、发帖血液+1▕▏升级条件：追随≥100
【等级3】5% 回帖血液+1、发帖血液+2▕▏升级条件：消耗200血液
【等级4】8% 回帖血液+2、发帖血液+2▕▏升级条件：消耗50咒术
【 Max 】12% 回帖血液+3、发帖血液+3 咒术+1`,
'亚瑟‧摩根': `亚瑟‧摩根
【入手条件】旅程≥15 堕落≥10
【商店售价】500金币
【等级1】4% 发帖金币+1▕▏升级条件：消耗200血液
【等级2】4% 回帖金币+1、发帖金币+1▕▏升级条件：消耗300金币
【等级3】6% 回帖金币+1、发帖金币+1▕▏升级条件：追随≥100
【等级4】8% 回帖金币+1、发帖金币+2 血液+1▕▏升级条件：旅程-2
【等级5】12% 回帖金币+2、发帖金币+2 旅程+1▕▏升级条件：堕落-15
【 Max 】16% 回帖金币+3、发帖金币+3 旅程+1`,
'蛮族战士': `蛮族战士
【入手条件】无
【商店售价】50金币
【等级1】勋章博物馆资料暂缺
【 Max 】5% 回帖血液+1`,
'黑墙': `黑墙
【入手条件】旅程≥15
【商店售价】400金币
【等级1】3% 回帖金币+1▕▏升级条件：追随≥20
【等级2】6% 回帖金币+1 血液+1▕▏升级条件：消耗200金币
【等级3】9% 回帖金币+1 血液+1▕▏升级条件：消耗200血液
【等级4】13% 回帖血液+2、发帖金币+1 血液+3▕▏升级条件：堕落≥50
【等级5】13% 回帖金币+1 血液+1、发帖金币+2 血液+2▕▏升级条件：堕落≥100
【 Max 】13% 回帖金币+2、发帖金币+3 血液+1`,
'内森·德雷克': `内森·德雷克
【入手条件】旅程≥10
【商店售价】600金币
【等级1】4% 回帖血液+1▕▏升级条件：消耗333血液
【等级2】6% 回帖血液+1▕▏升级条件：消耗10堕落
【等级3】8% 回帖血液+1▕▏升级条件：消耗333血液
【等级4】10% 回帖血液+2▕▏升级条件：消耗333血液
【等级5】20% 回帖血液+3、发帖旅程+1▕▏升级条件：获得299金币
【 Max 】15% 回帖血液+3、发帖血液+2 旅程+1`,
'丹尼爾·紐曼': `丹尼爾·紐曼
【入手条件】主题数≥3
【商店售价】350金币
【等级1】5% 回帖血液+1▕▏升级条件：金币≥400
【等级2】5% 回帖血液+1、发帖金币+1▕▏升级条件：血液≥400
【等级3】8% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：追随≥100
【 Max 】10% 回帖金币+1 血液+1、发帖金币+2 血液+2`,
'贝优妮塔': `贝优妮塔
【入手条件】咒术≥10
【商店售价】280金币
【等级1】5% 回帖堕落+1▕▏升级条件：堕落-10
【等级2】5% 回帖堕落+1 血液+1▕▏升级条件：70追随
【 Max 】5% 回帖堕落+1 血液+1 咒术+1`,
'英普瑞斯': `英普瑞斯
【入手条件】无
【商店售价】400金币
【等级1】3% 回帖堕落-1▕▏升级条件：追随≥70
【等级2】7% 回帖堕落-1 血液+1、发帖血液+1▕▏升级条件：消耗300金币
【等级3】10% 回帖金币+1 ，血液+1、发帖金币+1，血液+1▕▏升级条件：血液≥700
【 Max 】17% 回帖金币+1 ，血液+1、发帖金币+2，血液+2`,
'杰西·麦克雷': `杰西·麦克雷
【入手条件】无
【商店售价】500金币
【等级1】5% 回帖金币+1、发帖堕落+1▕▏升级条件：发帖数≥100
【等级2】8% 回帖金币+1、发帖堕落+1▕▏升级条件：主题数≥10
【等级3】10% 回帖金币+1 堕落+1、发帖堕落+1▕▏升级条件：堕落≥40
【等级4】15% 回帖金币+1 堕落+1、发帖旅程+1升级条件：消耗400血液
【 Max 】15% 回帖金币+2 堕落+1、发帖旅程+1 堕落+1`,
'卡德加（Khadgar）': `卡德加（Khadgar）
【入手条件】无
【商店售价】350金币
【等级1】3% 发帖堕落-1▕▏升级条件：咒术≥40
【等级2】6% 回帖堕落-1、发帖知识+1 堕落-1▕▏升级条件：消耗80咒术
【等级3】9% 回帖血液+1 堕落-1、发帖知识+1 堕落-1▕▏升级条件：消耗15堕落
【 Max 】12% 回帖血液+2 堕落-1、发帖知识+1 堕落-1`,
'麦迪文（Medivh）': `麦迪文（Medivh）
【入手条件】无
【商店售价】350金币
【等级1】4% 发帖咒术+1▕▏升级条件: 66咒术
【等级2】6% 回帖咒术+1、发帖咒术+1▕▏升级条件: 堕落≥50
【等级3】8% 回帖咒术+1、发帖咒术+1 堕落+1▕▏升级条件: 堕落≥99
【 Max 】12% 回帖咒术+1、发帖咒术+2 堕落+1`,
'遗忘之水': `遗忘之水
【入手条件】无
【商店售价】180金币
【等级1】无属性▕▏升级条件：消耗10堕落
【等级2】无属性▕▏升级条件：消耗10堕落
【等级3】无属性▕▏升级条件：消耗10堕落
【 Max 】无属性`,
'千杯不醉': `千杯不醉
【入手条件】无
【商店售价】12金币
【 Max 】5% 回帖血液+1 堕落+1、发帖血液+1 堕落+1`,
'送情书': `送情书（只可赠送）
【入手条件】无
【商店售价】15金币
【时效】5天
【 Max 】10% 回帖咒术+1、发帖咒术+1`,
'丢肥皂': `丢肥皂（只可赠送）
【入手条件】无
【商店售价】10金币
【时效】5天
【 Max 】10% 回帖堕落+1、发帖堕落+1`,
'灵光补脑剂': `灵光补脑剂（只可赠送）
【入手条件】无
【商店售价】22金币
【时效】3天
【等级1】升级条件：获得1知识
【 Max 】2% 回帖血液-1`,
'萨赫的蛋糕': `萨赫的蛋糕（只可赠送）
【入手条件】知识≥5
【商店售价】40金币
【时效】14天
【 Max 】10% 回帖血液+2、发帖血液+2`,
'神秘商店贵宾卡': `神秘商店贵宾卡（只可赠送）
【入手条件】知识≥10
【商店售价】50金币
【时效】7天
【等级1】10% 回帖金币+2▕▏升级条件：20咒术
【等级2】20% 回帖金币+2、发帖旅程+1▕▏升级条件：60咒术
【 Max 】30% 回帖金币+3、发帖旅程+1`,
'变骚喷雾': `变骚喷雾（只可赠送）
【入手条件】无
【商店售价】13金币
【时效】5天
【 Max 】5% 回帖堕落+1 金币+1、发帖堕落+1 金币+1`,
'贞洁内裤': `贞洁内裤（只可赠送）（已下架）
【入手条件】无
【商店售价】110金币
【 Max 】10% 回帖堕落-1、回帖金币-1、回帖血液-1`,
'没有梦想的咸鱼': `没有梦想的咸鱼（只可赠送）
【入手条件】无
【商店售价】1金币
【时效】1天
【 Max 】1% 回帖金币+1、回帖血液+1`,
'石肤术': `石肤术
【入手条件】无
【商店售价】4咒术
【时效】4天
【等级1】10% 回帖血液+1、发帖血液+1▕▏升级条件：血液≥200
【等级2】20% 回帖血液+1、发帖血液+1▕▏升级条件：血液≥400
【 Max 】40% 回帖血液+1、发帖血液+1`,
'吞食魂魄': `吞食魂魄
【入手条件】知识≥35
【商店售价】1灵魂
【时效】7天
【等级1】1% 无属性▕▏升级条件：获得1001血液
【等级2】10% 无属性▕▏升级条件：堕落≥10
【 Max 】10% 回帖血液-1、发帖血液-1`,
'咆哮诅咒': `咆哮诅咒
【入手条件】知识≥28
【商店售价】8咒术
【时效】3天
【等级1】30% 回帖堕落+3 血液-1▕▏升级条件：积分≥35
【 Max 】无属性`,
'霍格沃茨五日游': `霍格沃茨五日游
【入手条件】旅程≥10
【商店售价】8咒术
【时效】5天
【等级1】5% 回帖咒术+2▕▏升级条件：旅程≥10
【等级2】20% 发帖知识+1▕▏升级条件：知识≥20
【等级3】20% 回帖血液+3、发帖知识+1 血液+3▕▏升级条件：追随≥100
【等级4】20% 回帖血液+5、发帖旅程+1 血液+5▕▏升级条件：堕落≥50
【 Max 】20% 回帖血液+3、发帖堕落+1 血液+3`,
'祈祷术': `祈祷术
【入手条件】无
【商店售价】8咒术
【时效】8天
【等级1】15% 回帖堕落-1、发帖堕落-1▕▏升级条件：知识≥5
【等级2】15% 回帖堕落-1、发帖堕落-1▕▏升级条件：消耗1堕落
【等级3】12% 回帖堕落-1、发帖堕落-1▕▏升级条件：消耗1堕落
【等级4】10% 回帖堕落-1、发帖堕落-1▕▏升级条件：消耗1堕落
【等级5】8% 回帖堕落-1、发帖堕落-1▕▏升级条件：消耗1堕落
【等级6】6% 回帖堕落-1、发帖堕落-1▕▏升级条件：消耗1堕落
【 Max 】4% 回帖堕落-1、发帖堕落-1`,
'黑暗交易': `黑暗交易
【入手条件】堕落＞10 知识≥10
【商店售价】8咒术
【时效】3天
【等级1】25% 回帖金币+2 血液-1、发帖金币+2 血液-1▕▏升级条件：堕落≥25
【等级2】25% 回帖金币+4 血液-2、发帖金币+4 血液-2▕▏升级条件：堕落≥50
【 Max 】25% 回帖金币+6 血液-3、发帖金币+6 血液-3`,
'炼金之心': `炼金之心
【入手条件】无
【商店售价】4咒术
【时效】3天
【等级1】15% 回帖金币+2▕▏升级条件：知识≥15
【等级2】20% 回帖金币+2▕▏升级条件：知识≥30
【 Max 】30% 回帖金币+2`,
'水泡术': `水泡术
【入手条件】知识≥ 3
【商店售价】3咒术
【时效】5天
【等级1】无属性▕▏升级条件：知识≥6
【等级2】无属性▕▏升级条件：血液-10
【 Max 】1% 回帖血液+1`,
'召唤古代战士': `召唤古代战士
【入手条件】知识≥ 6
【商店售价】8咒术
【时效】5天
【等级1】10% 回帖血液+3、发帖血液+3▕▏升级条件：知识≥25
【 Max 】30% 回帖血液+3、发帖血液+3`,
'念念往日士官盔': `念念往日士官盔
【入手条件】无
【商店售价】125金币
【 Max 】30% 回帖金币-1 血液+1`,
'药剂背袋': `药剂背袋
【入手条件】无
【商店售价】100金币
【 Max 】8% 回帖血液+1、发帖血液+1`,
'刺杀者匕首': `刺杀者匕首
【入手条件】堕落＞10
【商店售价】80金币
【 Max 】5% 回帖金币+3`,
'净化手杖': `净化手杖
【入手条件】堕落＜50
【商店售价】400金币
【等级1】10% 发帖 堕落 -1▕▏升级条件：在线时间≥800
【 Max 】20% 回帖 堕落 -1、发帖 堕落 -1、咒术 +1`,
'符文披风': `符文披风
【入手条件】无
【商店售价】280金币
【 Max 】8% 回帖咒术+1、发帖咒术+1`,
'嗜血斩首斧': `嗜血斩首斧
【入手条件】无
【商店售价】100金币
【 Max 】5% 回帖堕落+1`,
'圣英灵秘银甲': `圣英灵秘银甲
【入手条件】无
【商店售价】1350金币
【等级1】11% 回帖血液+2 堕落-1、发帖血液+2 堕落-1▕▏升级条件：消耗1灵魂
【等级2】31% 回帖血液+2 堕落-1、发帖血液+2 堕落-1▕▏升级条件：咒术≥111
【 Max 】41% 回帖血液+2 堕落-1、发帖血液+2 堕落-1 旅程+1`,
'重磅手环': `重磅手环
【入手条件】无
【商店售价】250金币
【 Max 】20% 发帖血液-5 旅程+1`,
'新月护符': `新月护符
【入手条件】血液≥50
【商店售价】200金币
【等级1】5% 回帖堕落-1、发帖堕落-1▕▏升级条件：旅程≥90
【 Max 】10% 回帖堕落-2、发帖堕落-2 旅程+1 `,
'布衣': `布衣
【入手条件】无
【商店售价】45金币
【等级1】1% 回帖血液-1▕▏升级条件：消耗 2金币
【等级2】无属性▕▏升级条件：消耗 4金币
【等级3】1% 回帖血液+1▕▏升级条件：消耗16金币
【等级4】1% 回帖血液+1▕▏升级条件：消耗18金币
【等级5】1% 回帖血液+1▕▏升级条件：消耗20金币
【等级6】1% 回帖血液+1▕▏升级条件：消耗22金币
【等级7】2% 回帖血液+1▕▏升级条件：消耗34金币
【等级8】2% 回帖血液+1、发帖血液+1▕▏升级条件：消耗36金币
【等级9】2% 回帖血液+2、发帖血液+2▕▏升级条件：消耗38金币
【等级10】2% 回帖血液+2、发帖血液+3▕▏升级条件：消耗50金币
【等级11】2% 回帖血液+2 咒术+1、发帖血液+2 咒术+2▕▏升级条件：消耗52金币
【等级12】2% 回帖血液+2 咒术+1、发帖血液+2 咒术+3▕▏升级条件：消耗64金币
【等级13】2% 回帖血液+3 知识+1、发帖血液+3 知识+1▕▏升级条件：消耗250血液
【 Max 】3% 回帖血液+5 咒术-1、发帖血液+5 咒术-1（不确定准确性）`,
'骑士遗盔': `骑士遗盔
【入手条件】无
【商店售价】275金币
【等级1】1% 回帖咒术+1▕▏升级条件：25金币
【等级2】2% 回帖咒术+1、发帖知识+1▕▏升级条件：50金币
【等级3】3% 回帖咒术+1、发帖知识+1▕▏升级条件：100金币
【 Max 】5% 回帖咒术+1 血液+1、发帖知识+1 `,
'艾尔尤因': `艾尔尤因
【入手条件】无
【商店售价】470金币
【等级1】5% 回帖血液+1、发帖血液+1▕▏升级条件：血液≥300
【等级2】5% 回帖咒术+1、发帖咒术+1▕▏升级条件：血液≥500
【 Max 】10% 回帖血液+1 堕落-1、发帖血液+1 堕落-1`,
'变形软泥': `变形软泥
【入手条件】无
【商店售价】66金币
【等级1】无属性▕▏升级条件：堕落≥13
【等级2】3% 回帖堕落+2▕▏升级条件：消耗166金币
【 Max 】6% 回帖堕落+2、发帖咒术+1`,
'神圣十字章': `神圣十字章
【入手条件】旅程＞12
【商店售价】300金币
【等级1】5% 回帖血液+1、发帖血液+1▕▏升级条件：消耗8咒术
【等级2】10% 回帖血液+1、发帖血液+1▕▏升级条件：获得20血液
【 Max 】5% 回帖血液+2 发帖血液+2`,
'超级名贵无用宝剑': `超级名贵无用宝剑
【入手条件】无
【商店售价】1299金币
【 Max 】无属性`,
'十字叶章': `十字叶章
【入手条件】无
【商店售价】277金币
【等级1】5% 回帖堕落-1▕▏升级条件：45追随
【等级2】5% 回帖堕落-1 咒术+1、发帖咒术+1▕▏升级条件：80血液
【 Max 】1% 回帖堕落-5 咒术+5、发帖灵魂+1`,
'守望者徽章': `守望者徽章
【入手条件】血液≥200
【商店售价】100金币
【等级1】2% 回帖血液+1▕▏升级条件：消耗50血液
【等级2】4% 回帖血液+1▕▏升级条件：消耗50血液
【等级3】6% 回帖血液+2▕▏升级条件：堕落≥30
【 Max 】8% 回帖血液+2 堕落-1`,
'山猫图腾': `山猫图腾
【入手条件】无
【商店售价】88金币
【 Max 】2% 回帖金币+1、发帖金币+1`,
'眼镜蛇图腾': `眼镜蛇图腾
【入手条件】无
【商店售价】88金币
【 Max 】1% 回帖咒术+1、发帖咒术+1`,
'猎鹰图腾': `猎鹰图腾
【入手条件】无
【商店售价】88金币
【 Max 】2% 回帖血液+1、发帖血液+1`,
'石鬼面': `石鬼面
【入手条件】血液≥30
【商店售价】233金币
【等级1】9% 回帖咒术+1 血液-1▕▏升级条件：血液≥400
【 Max 】18% 回帖咒术+1 血液-3 堕落+1、发帖咒术+1`,
'锻造卷轴': `锻造卷轴
【入手条件】无
【商店售价】99金币
【 Max 】1% 回帖金币+1 知识+1、发帖金币+1 知识+1`,
'漂洋小船': `漂洋小船
【入手条件】无
【商店售价】75金币
【 Max 】2% 回帖旅程+1`,
'知识大典': `知识大典
【入手条件】无
【商店售价】50金币
【 Max 】1% 回帖知识+1`,
'预知水晶球': `预知水晶球
【入手条件】咒术≥10
【商店售价】150金币
【等级1】4% 回帖金币+1、发帖知识+1▕▏升级条件：消耗40咒术
【 Max 】8% 回帖金币+1、发帖知识+1 旅程+1`,
'种植小草': `种植小草
【入手条件】无
【商店售价】15金币
【等级1】无属性▕▏升级条件：追随≥5
【等级2】无属性▕▏升级条件：追随≥10
【等级3】无属性▕▏升级条件：追随≥15
【等级4】无属性▕▏升级条件：获得1血液
【 Max 】1% 回帖血液+1`,
'聚魔花盆': `聚魔花盆
【入手条件】无
【商店售价】500金币
【等级1】10% 发帖咒术+3▕▏升级条件：5知识
【等级2】20% 发帖咒术+3▕▏升级条件：10知识
【等级6】60% 发帖咒术+3▕▏升级条件：30堕落
【 Max 】30% 发帖咒术+3`,
'夜灯': `夜灯
【入手条件】无
【商店售价】40金币
【等级1】1% 回帖血液+1▕▏升级条件：消耗15金币
【等级2】2% 回帖血液+1▕▏升级条件：消耗30金币
【等级3】3% 回帖血液+1▕▏升级条件：消耗45金币
【等级4】4% 回帖血液+1▕▏升级条件：消耗60金币
【等级5】5% 回帖血液+1▕▏升级条件：消耗75金币
【等级6】6% 回帖血液+1▕▏升级条件：消耗90金币
【等级7】7% 回帖血液+1▕▏升级条件：获得6旅程
【 Max 】7% 回帖血液+1`,
'种植菊花': `种植菊花
【入手条件】无
【商店售价】110金币
【等级1】1% 回帖堕落+1▕▏升级条件：消耗20血液
【等级2】3% 回帖堕落+1▕▏升级条件：消耗50血液
【等级3】5% 回帖血液+1 堕落+1▕▏升级条件：获得30金币
【 Max 】3% 回帖金币+1 堕落+1、发帖-1血液`,
'发芽的种子': `发芽的种子
【入手条件】在线时间＞10小时
【商店售价】77金币
【等级1】无属性▕▏升级条件：消耗50血液
【等级2】无属性▕▏升级条件：消耗50血液
【等级3】无属性▕▏升级条件：消耗50血液
【 Max 】7% 回帖金币+1、发帖金币+2`,
'奇怪的紫水晶': `奇怪的紫水晶
【入手条件】无
【商店售价】299金币
【等级1】5% 回帖血液-1 咒术+2 堕落+1▕▏升级条件：消耗35咒术
【 Max 】1% 回帖知识+1 咒术+1、发帖灵魂+1`,
'婴儿泪之瓶': `婴儿泪之瓶
【入手条件】无
【商店售价】200金币
【等级1】2% 回帖堕落-1、发帖堕落-1▕▏升级条件：50金币
【等级2】2% 回帖堕落-1 知识+1、发帖堕落-1 知识+1▕▏升级条件：100金币
【 Max 】3% 回帖堕落-1 知识+1、发帖堕落-1 知识+1`,
'雪王的心脏': `雪王的心脏
【入手条件】无
【商店售价】180金币
【等级1】2% 回帖旅程+1 旅程+1▕▏升级条件：30咒术
【等级2】2% 回帖知识+1 旅程+1、发帖知识+1 旅程+1▕▏升级条件：50咒术
【 Max 】3% 回帖知识+1 旅程+1、发帖知识+1 旅程+1`,
'这是一片丛林': `这是一片丛林
【入手条件】无
【商店售价】120金币
【等级1】无属性▕▏升级条件：堕落≥35
【等级2】3% 回帖咒术+1▕▏升级条件：堕落≥70
【 Max 】3% 回帖旅程+1`,
'暗红矿土': `暗红矿土
【入手条件】堕落≥20
【商店售价】40金币
【等级1】1% 回帖血液+1▕▏升级条件：消耗30金币
【等级2】4% 回帖堕落+1▕▏升级条件：消耗70金币
【等级3】1% 回帖血液+2▕▏升级条件：消耗200金币
【 Max 】12% 回帖血液+1 堕落+1、发帖血液+2 咒术+2`,
'充满魔力的种子': `充满魔力的种子
【入手条件】旅程≥20 知识≥ 4
【商店售价】250金币
【等级1】无属性▕▏升级条件：20咒术
【等级2】5% 回帖知识+1▕▏升级条件：在线时间240
【等级3】5% 回帖知识+1、发帖知识+2▕▏升级条件：20咒术
【等级4】无属性▕▏升级条件：10咒术
【 Max 】8% 回帖金币+2 咒术+1、发帖知识+2`,
'史莱姆养殖证书': `史莱姆养殖证书
【入手条件】无
【商店售价】60金币
【等级1】1% 金币+1▕▏升级条件：100金币
【等级2】2% 回帖金币+1▕▏升级条件：100金币
【等级3】3% 回帖金币+1▕▏升级条件：100金币
【等级4】4% 回帖金币+1▕▏升级条件：100金币
【等级5】5% 回帖金币+1▕▏升级条件：100金币
【等级6】8% 回帖金币+1▕▏升级条件：8知识
【等级9】12% 回帖金币+1▕▏升级条件：100金币
【等级11】15% 回帖金币+1▕▏升级条件：100金币
【等级17】25% 回帖金币+1▕▏升级条件：100金币
【等级25】38% 回帖金币+1▕▏升级条件：100金币
【等级27】42% 回帖金币+1▕▏升级条件：100金币
【等级29】45% 回帖金币+1▕▏升级条件：100金币
【等级32】70% 回帖金币+1、发帖金币+1▕▏升级条件：160血液
【等级34】70% 回帖金币+1、发帖金币+1▕▏升级条件：320血液
【等级39】100% 回帖血液+1 金币+1、发帖金币+1▕▏升级条件：620血液
【等级41】15% 回帖咒术+1 金币+1、发帖金币+1▕▏升级条件：720血液
【等级42】70% 回帖金币+1、发帖金币+1▕▏升级条件：820血液
【等级43】100% 回帖血液+1 金币+1、发帖金币+1▕▏升级条件：850血液
【等级44】70% 回帖金币+1、发帖金币+1▕▏升级条件：990血液
【等级46】70% 回帖金币+1、发帖金币+1▕▏升级条件：1130血液
【等级48】70% 回帖金币+1、发帖金币+1▕▏升级条件：1280血液
【等级51】70% 回帖金币+1、发帖金币+1▕▏升级条件：1470血液
【等级52】10% 回帖金币+1、发帖金币+1▕▏升级条件：1500血液
【等级53】70% 回帖金币+1、发帖金币+1▕▏升级条件：1610血液
【等级54】100% 回帖血液+1 金币+1、发帖金币+1▕▏升级条件：1650血液
【等级55】70% 回帖金币+1、发帖金币+1▕▏升级条件：1780血液
【等级58】70% 回帖金币+1、发帖金币+1▕▏升级条件：1880血液
【等级60】70% 回帖金币+1、发帖金币+1▕▏升级条件：1920血液
【等级61】100% 回帖血液+1 金币+1、发帖金币+1▕▏升级条件：1950血液
【等级62】70% 回帖金币+1、发帖金币+1▕▏升级条件：2000血液
【 Max 】无属性`,
'种植菠菜': `种植菠菜
【入手条件】主题数≥ 5
【商店售价】30金币
【等级1】无属性▕▏升级条件：知识≥1
【等级2】无属性▕▏升级条件：消耗10金币
【等级3】无属性▕▏升级条件：知识≥2
【等级4】无属性▕▏升级条件：消耗10金币
【等级5】无属性▕▏升级条件：知识≥3
【等级6】无属性▕▏升级条件：消耗15金币
【等级7】5% 回帖血液+1、发帖血液+1▕▏升级条件：血液-35
【 Max 】无属性`,
'勇者与龙之书': `勇者与龙之书
【入手条件】无
【商店售价】300金币
【等级1-9】无属性▕▏升级条件：消耗1旅程
【等级10】无属性▕▏升级条件：获得9旅程
【 Max 】3% 回帖旅程+1`,
'微笑的面具': `微笑的面具
【入手条件】无
【商店售价】100金币
【等级1】无属性▕▏升级条件：10主题数
【等级3】无属性▕▏升级条件：30主题数
【等级5】无属性▕▏升级条件：50主题数
【 Max 】20% 回帖堕落+1、发帖堕落+1`,
'浪潮之歌': `浪潮之歌
【入手条件】旅程≥70
【商店售价】300金币
【等级1-9】无属性▕▏升级条件：消耗1旅程
【等级10】无属性▕▏升级条件：获得9旅程
【 Max 】3% 回帖金币+1 旅程+1、发帖金币+1 旅程+1`,
'章鱼小丸子': `章鱼小丸子
【入手条件】无
【商店售价】150金币
【等级1】10% 回帖血液+1▕▏升级条件：血液-10
【等级2】7% 回帖血液+1▕▏升级条件：血液-20
【等级3】5% 回帖血液+1▕▏升级条件：血液-20
【等级4】3% 回帖血液+2▕▏升级条件：血液-30
【 Max 】无属性`,
'流失之椅': `流失之椅
【入手条件】无
【商店售价】320金币
【等级1】40% 回帖血液+1、发帖旅程+1▕▏升级条件：80在线时间
【等级2】32% 回帖血液+1、发帖旅程+1▕▏升级条件：150在线时间
【等级3】24% 回帖血液+1、发帖旅程+1▕▏升级条件：300在线时间
【等级4】17% 回帖血液+1、发帖旅程+1▕▏升级条件：500在线时间
【等级5】9% 回帖血液+1、发帖旅程+1▕▏升级条件：800在线时间
【等级6】3% 回帖血液+1、发帖旅程+1▕▏升级条件：1000在线时间
【等级7】无属性▕▏升级条件：1灵魂
【 Max 】50% 回帖血液+1、发帖旅程+1`,
'金钱马车': `金钱马车
【入手条件】旅程≥10
【商店售价】200金币
【等级1】1% 无属性▕▏升级≥1金币
【等级2】23% 回帖金币+1▕▏升级≥50金币
【等级3】15% 回帖金币+2▕▏升级≥100金币
【等级4】26% 回帖金币+2▕▏升级≥187金币
【等级5】55% 回帖咒术+1▕▏升级≥189金币
【等级6】40% 回帖金币+3▕▏升级≥250金币
【等级7】7% 回帖金币+1▕▏升级≥345金币
【等级8】60% 回帖金币+10▕▏升级≥346金币
【等级9】10% 回帖血液-1▕▏升级≥360金币
【等级10】15% 回帖金币+2▕▏升级≥501金币
【等级11】18% 回帖知识+1▕▏升级≥502金币
【等级12】7% 回帖金币+1▕▏升级≥617金币
【等级13】26% 回帖金币+2▕▏升级≥749金币
【等级14】2% 发帖灵魂+1▕▏升级≥750金币
【等级15】30% 回帖金币+3 血液+1▕▏升级≥823金币
【等级16】23% 回帖金币+1▕▏升级≥978金币
【等级17】25% 无属性▕▏升级≥1000金币
【等级18】15% 回帖金币+2▕▏升级≥1092金币
【等级19】16% 回帖金币+2▕▏升级≥1202金币
【等级20】55% 回帖咒术+1▕▏升级≥1204金币
【等级21】40% 回帖金币+3▕▏升级≥1250金币
【等级22】7% 回帖金币+1▕▏升级≥1334金币
【等级23】60% 回帖金币+10▕▏升级≥1335金币
【等级24】23% 回帖金币+1▕▏升级≥1500金币
【等级25】15% 回帖金币+2▕▏升级≥1666金币
【等级26】2% 发帖灵魂+1▕▏升级≥1667金币
【等级27】无属性▕▏升级≥1699金币
【等级28】23% 回帖金币+1▕▏升级≥1750金币
【等级29】10% 回帖血液-1▕▏升级≥1763金币
【等级30】30% 回帖金币+3 血液+1▕▏升级≥1811金币
【等级31】7% 回帖金币+1▕▏升级≥1888金币
【等级32】18% 回帖知识+1▕▏升级≥1889金币
【等级33】26% 回帖金币+2▕▏升级≥2000金币
【等级34】23% 回帖金币+1▕▏升级≥2073金币
【等级35】3% 无属性▕▏升级≥2101金币
【等级36】27% 回帖金币+3▕▏升级≥2250金币
【等级37】15% 回帖金币+2▕▏升级≥2348金币
【等级38】60% 回帖金币+10▕▏升级≥2349金币
【等级39】40% 回帖金币+3▕▏升级≥2401金币
【等级40】7% 回帖金币+1▕▏升级≥2500金币
【等级41】18% 回帖知识+1▕▏升级≥2501金币
【等级42】26% 回帖金币+2▕▏升级≥2615金币
【等级43】23% 回帖金币+1▕▏升级≥2748金币
【等级44】55% 回帖咒术+1▕▏升级≥2750金币
【等级45】10% 回帖血液-1▕▏升级≥2866金币
【等级46】7% 回帖金币+1▕▏升级≥2903金币
【等级47】2% 发帖灵魂+1▕▏升级≥2904金币
【等级48】15% 回帖金币+2▕▏升级≥2962金币
【等级49】30% 回帖金币+3 血液+1▕▏升级≥3000金币
【 Max 】无属性`,
'木柴堆': `木柴堆
【入手条件】旅程≥18
【商店售价】90金币
【等级1】1% 回帖金币+1▕▏升级条件：消耗5血液
【等级2】5% 回帖金币+1▕▏升级条件：消耗150金币
【等级3】1% 无属性▕▏升级条件：消耗30血液
【 Max 】10% 回帖金币+1、发帖金币+3 旅程+1`,

'神秘的邀请函': `神秘的邀请函
【入手条件】主题≥ 3 在线时间＞12小时
【商店售价】100金币
【等级1】1% 回帖金币+1、发帖金币+1▕▏升级条件：80血液
【等级2】1% 回帖血液+1、发帖血液+1▕▏升级条件：80金币
【等级3】5% 回帖血液-1▕▏升级条件：30追随
【等级4】5% 回帖金币+3 血液-1、发帖金币+3 血液-1▕▏升级条件：10知识
【等级5】10% 回帖血液+1 金币+1、发帖血液+2 金币+3▕▏升级条件：金币-100
【 Max 】无属性`,
'诺曼底号': `诺曼底号
【入手条件】无
【商店售价】8700金币
【等级1】无属性▕▏升级条件：金币≥100
【等级2】50% 发帖血液+7▕▏升级条件：金币≥1000
【等级3】50% 发帖血液+7 旅程+1▕▏升级条件：金币≥5000
【等级4】50% 发帖血液+7 旅程+1 咒术+3▕▏升级条件：金币≥10000
【等级5】50% 发帖旅程+1 血液+7 咒术+3 知识+1，▕▏升级条件：金币≥20000
【 Max 】无属性`,
'德拉克魂匣': `德拉克魂匣
【入手条件】知识≥10
【商店售价】350血液
【等级1】5% 回帖血液+1 血液+1▕▏升级条件：60知识（属性不确定）
【等级2】8% 回帖血液+1、发帖血液+2▕▏升级条件：知识≥120
【等级3】14%回帖血液+1、发帖血液+2 咒术+1  ▕▏升级条件：知识≥180
【 Max 】20% 回帖血液+2、发帖血液+3 咒术+1`,
'圣甲虫秘典': `圣甲虫秘典
【入手条件】知识≥10
【商店售价】350金币
【等级1】5% 回帖金币+1、发帖金币+1▕▏升级条件：50咒术
【等级2】10% 回帖金币+1、发帖金币+2▕▏升级条件：100知识
【等级3】15% 回帖金币+2、发帖金币+3▕▏升级条件：200知识（猜的，不确定）
【 Max 】25% 回帖金币+3、发帖金币+4`,
'生化危机：复仇': `生化危机：复仇
【入手条件】无
【商店售价】100金币
【 Max 】1% 回帖金币+1 血液+1 `,
'五花八门版块': `五花八门版块
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖咒术+1`,
'奥兹大陆': `奥兹大陆
【入手条件】旅程＞25 在线时间＞255小时
【商店售价】100金币
【 Max 】2% 回帖咒术+1 咒术+1`,
'龙腾世纪：审判': `龙腾世纪：审判
【入手条件】无
【商店售价】100金币
【 Max 】1% 回帖旅程+1`,
'质量效应三部曲': `质量效应三部曲
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖血液+2`,
'辐射:新维加斯': `辐射:新维加斯
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖堕落+1`,
'TRPG纪念章': `TRPG纪念章
【入手条件】完成TRPG版块内的跑团任务
【商店售价】无
【等级1】无属性▕▏升级条件:-100金币
【 Max 】2% 回帖金币+1 血液+1`,
'上古卷轴V:天际': `上古卷轴V:天际
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖金币+2`,
'堕落飨宴': `堕落飨宴
【入手条件】旅程≥20 在线时间≥100小时 数≥100 主题≥10
【商店售价】9999金币
【等级2】无属性▕▏升级条件：血液-500
【等级9】无属性▕▏升级条件：堕落-50
【等级11】无属性▕▏升级条件：堕落-60
【等级13】无属性▕▏升级条件：堕落-70
【 Max 】1% 回帖金币+5 血液+5 堕落+5、发帖灵魂+1 咒术+10 `,
'模擬人生4': `模擬人生4
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖金币+1`,
'达拉然': `达拉然
【入手条件】旅程≥25 知识≥25
【商店售价】100金币
【 Max 】2% 回帖知识+1`,
'牧羊人': `牧羊人
【入手条件】发帖数>=100
【商店售价】无
【等级1】5% 发帖旅程+1▕▏升级条件：发帖数>250
【等级2】8% 发帖旅程+1▕▏升级条件：发帖数>500
【 Max 】10% 发帖旅程+1`,
'森林羊男': `森林羊男
【入手条件】注册天数>45 并且 在线时间(小时)>200 井且 血液>150井且 旅程>50
【商店售价】无
【 Max 】5% 回帖知识+1、发帖知识+1`,
'堕落之舞': `堕落之舞
【入手条件】堕落>40
【商店售价】无
【 Max 】35% 发帖金币+3`,
'黄色就是俏皮': `黄色就是俏皮
【入手条件】堕落>20 幷且 血液>60 并且主题数 >= 6
【商店售价】无
【等级1】3% 回帖血液+1、发帖血液+1▕▏升级条件：50主题数
【 Max 】10% 回帖血液+1、发帖血液+1`,
'骑兽之子': `骑兽之子
【入手条件】旅程 >= 120 井且 灵魂 >=1
【商店售价】无
【等级1】20% 回帖血液+1、发帖血液+3 咒术+1▕▏升级条件：灵魂 ≥ 3
【 Max 】50% 回帖血液+1、发帖血液+3 咒术+1`,
'禽兽扒手': `禽兽扒手
【入手条件】追随 >= 35 幷且 旅程 >= 45 并且 知识 >= 15
【商店售价】无
【等级1】10% 回帖血液-1 咒术+1▕▏升级条件：101在线时间
【等级2】30% 回帖血液-1 咒术+1▕▏升级条件：110在线时间
【等级3】10% 回帖血液-1 咒术+1▕▏升级条件：201在线时间
【等级4】30% 回帖血液-1 咒术+1▕▏升级条件：210在线时间
【等级5】10% 回帖血液-1 咒术+1▕▏升级条件：301在线时间
【等级6】30% 回帖血液-1 咒术+1▕▏升级条件：310在线时间
【等级7】10% 回帖血液-1 咒术+1▕▏升级条件：401在线时间
【等级8】30% 回帖血液-1 咒术+1▕▏升级条件：410在线时间
【等级9】10% 回帖血液-1 咒术+1▕▏升级条件：501在线时间
【等级10】30% 回帖血液-1 咒术+1▕▏升级条件：510在线时间
【等级11】10% 回帖血液-1 咒术+1▕▏升级条件：601在线时间
【等级12】30% 回帖血液-1 咒术+1▕▏升级条件：610在线时间
【等级13】10% 回帖血液-1 咒术+1▕▏升级条件：701在线时间
【等级14】10% 回帖血液-1 咒术+1▕▏升级条件：710在线时间
【等级15】10% 回帖血液-1 咒术+1▕▏升级条件：801在线时间
【等级16】30% 回帖血液-1 咒术+1▕▏升级条件：810在线时间
【等级17】10% 回帖血液-1 咒术+1▕▏升级条件：901在线时间
【等级18】30% 回帖血液-1 咒术+1▕▏升级条件：910在线时间
【等级19】10% 回帖血液-1 咒术+1▕▏升级条件：1001在线时间
【等级20】30% 回帖血液-1 咒术+1▕▏升级条件：1100在线时间
【等级21】10% 回帖血液-1 咒术+1▕▏升级条件：2001在线时间
【等级22】30% 回帖血液-1 咒术+1▕▏升级条件：2100在线时间
【等级23】10% 回帖血液-1 咒术+1▕▏升级条件：3001在线时间
【 Max 】35% 回帖血液-1 咒术+1`,
'野兽之子': `野兽之子
【入手条件】在线时间(小时) >= 200 井且 旅程 >= 20 井且 知识 >= 20 并且追随>= 20
【商店售价】无
【等级1】无属性▕▏升级条件：金币≥200
【等级2】3% 回帖知识+1 血液-1▕▏升级条件：金币≥400
【等级3】5% 回帖知识+1 血液-1▕▏升级条件：金币≥600
【等级4】7% 回帖知识+1 血液-1▕▏升级条件：金币≥800
【 Max 】9% 回帖知识+1 血液-1`,
'结晶卵': `结晶卵
【入手条件】知识≥15
【商店售价】280金币
【等级1】2% 发帖知识+1▕▏升级条件：咒术≥40
【等级2】4% 回帖咒术+1、发帖知识+1▕▏升级条件：咒术≥80
【 Max 】8% 回帖咒术+2、发帖知识+1 咒术+2`,
'暮色卵': `暮色卵
【入手条件】旅程≥15
【商店售价】260金币
【等级1】4% 回帖堕落+1▕▏升级条件：堕落≥80
【等级2】7% 回帖堕落+1、发帖血液+2▕▏升级条件：堕落≥150
【 Max 】15% 回帖堕落+1 血液+1、发帖血液+3`,
'青鸾蛋': `青鸾蛋
【入手条件】旅程≥29
【商店售价】220金币
【等级1】6% 回帖金币+1▕▏升级条件：主题数≥20
【 Max 】12% 回帖血液+1 金币+1、发帖旅程+1`,
'电磁卵': `电磁卵
【入手条件】咒术≥30
【商店售价】240金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗11咒术
【等级2】10% 回帖金币+2▕▏升级条件：消耗33咒术
【 Max 】15% 回帖金币+2`,
'珊瑚色礁石蛋': `珊瑚色礁石蛋
【入手条件】发帖数≥150
【商店售价】260金币
【等级1】4% 回帖咒术+1 血液+1、发帖咒术+2▕▏升级条件：消耗188金币
【 Max 】8% 回帖咒术+1 血液+2、发帖咒术+2`,
'月影蛋': `月影蛋
【入手条件】血液≥303
【商店售价】310金币
【等级1】5% 回帖血液+2、发帖咒术+1▕▏升级条件：消耗30咒术
【等级2】10% 回帖血液+2、发帖咒术+1▕▏升级条件：血液≥388
【 Max 】15% 回帖血液+2、发帖咒术+1`,
'马戏团灰蛋': `马戏团灰蛋
【入手条件】旅程≥25
【商店售价】270金币
【等级1】5% 回帖金币+1、发帖堕落+1▕▏升级条件：消耗180血液
【等级2】10% 回帖金币+2、发帖堕落+1▕▏升级条件：消耗150金币
【 Max 】12% 回帖血液+2、发帖旅程+1`,
'郁苍卵': `郁苍卵
【入手条件】旅程≥35
【商店售价】350金币
【等级1】5% 回帖血液+2▕▏升级条件：消耗369金币
【 Max 】15% 回帖血液+2、发帖血液+3`,
'熔岩蛋': `熔岩蛋
【入手条件】旅程≥35
【商店售价】350金币
【等级1】5% 回帖金币+2▕▏升级条件：消耗369血液
【 Max 】15% 回帖金币+2、发帖金币+3`,
'灵鹫蛋': `灵鹫蛋
【入手条件】堕落≤19
【商店售价】310金币
【等级1】3% 回帖血液+1、发帖知识+1▕▏升级条件：主题≥10
【等级2】6% 回帖血液+1、发帖知识+1▕▏升级条件：消耗210金币
【等级3】10% 回帖血液+2 堕落-1、发帖知识+1▕▏升级条件：主题≥50
【 Max 】15% 回帖血液+2 堕落-1、发帖知识+1`,
'血鹫蛋': `血鹫蛋
【入手条件】堕落≥25
【商店售价】310金币
【等级1】3% 回帖金币+1、发帖旅程+1▕▏升级条件：维持50咒术
【等级2】6% 回帖金币+1、发帖旅程+1▕▏升级条件：消耗210血液
【等级3】10% 回帖金币+2 堕落+1、发帖旅程+1▕▏升级条件：维持150咒术
【 Max 】15% 回帖金币+2 堕落+1、发帖旅程+1`,
'软泥怪蛋': `软泥怪蛋
【入手条件】主题≥30
【商店售价】150金币
【等级1】4% 回帖血液+2▕▏升级条件：消耗220金币
【 Max 】4% 回帖血液+1 旅程+1`,
'螺旋纹卵': `螺旋纹卵
【入手条件】旅程≥33
【商店售价】270金币
【等级1】5% 回帖堕落+1 金币+1▕▏升级条件：消耗188血液
【 Max 】11% 回帖堕落+1 金币+1`,
'万圣彩蛋': `万圣彩蛋
【入手条件】追随≥35
【商店售价】310金币
【等级1】6% 回帖金币+2、发帖金币+2▕▏升级条件：消耗33咒术
【 Max 】12% 回帖金币+2、发帖金币+2`,
'幽光彩蛋': `幽光彩蛋
【入手条件】知识≥22
【商店售价】300金币
【等级1】5% 回帖血液+1、发帖咒术+1▕▏升级条件：消耗25咒术
【 Max 】14% 回帖血液+2、发帖咒术+1`,
'沙漠羽蛋': `沙漠羽蛋
【入手条件】旅程≥25
【商店售价】250金币
【等级1】5% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗173金币
【 Max 】10% 回帖血液+2、发帖旅程+1`,
'林中之蛋': `林中之蛋
【入手条件】旅程≥35
【商店售价】275金币
【等级1】6% 回帖金币+1 血液+1▕▏升级条件：消耗213血液
【 Max 】12% 回帖金币+1 血液+1`,
'五彩斑斓的蛋': `五彩斑斓的蛋
【入手条件】堕落≤100 旅程≥50
【商店售价】220金币
【等级1】2% 回帖血液+1▕▏升级条件：消耗100血液
【等级2】5% 回帖咒术+1 血液-1▕▏升级条件：消耗50咒术
【 Max 】8% 回帖咒术+2 堕落-1`,
'血红色的蛋': `血红色的蛋
【入手条件】堕落≥60
【商店售价】290金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗75血液
【等级2】10% 回帖金币+1 堕落+1▕▏升级条件：消耗100血液
【 Max 】15% 回帖金币+1 堕落+1`,
'海边的蛋': `海边的蛋
【入手条件】在线时间≥300小时
【商店售价】288金币
【等级1】10% 回帖金币+1▕▏升级条件：消耗100金币
【 Max 】20% 回帖金币+1、发帖金币+3`,
'新手蛋': `新手蛋
【入手条件】发帖数＞＝50 主题数＞＝ 2
【商店售价】120金币
【等级1】10% 回帖金币+1▕▏升级条件：发帖数≥150
【等级2】20% 回帖金币+1▕▏升级条件：发帖数≥300
【等级3】30% 回帖金币+1▕▏升级条件：发帖数≥500
【 Max 】5% 回帖金币+1`,
'深渊遗物': `有一个Pet宠物类和一个Prize活动奖励类
深渊遗物（类别：宠物Pet)
【入手条件】【星尘月陨】活动奖励。
【商店售价】【星尘月陨】活动奖励。
【等级1】1% 回帖血液+3▕▏升级条件：-1旅程
【 Max 】10% 回帖血液+3、发帖旅程+1

深渊遗物（类别：活动奖励Prize）
【等级1】1% 回帖血液+1▕▏升级条件：消耗50血液
【等级1】1% 回帖血液+2▕▏升级条件：消耗10咒术
【 Max 】1% 回帖血液+3
`,
'小阿尔的蛋': `小阿尔的蛋
【入手条件】在线时间≥200小时
【商店售价】388金币
【等级1】5% 回帖血液+1、发帖金币+2▕▏升级条件：消耗150金币
【等级2】8% 回帖血液+1、发帖金币+2▕▏升级条件：消耗200血液
【等级3】10% 回帖血液+2、发帖金币+2▕▏升级条件：在线时间≥1000小时
【 Max 】15% 回帖血液+2、发帖金币+3`,
'红石': `红石
【入手条件】血液≥30
【商店售价】177金币
【等级1】4% 回帖血液+1、发帖血液+1▕▏升级条件：血液≥233
【 Max 】8% 回帖血液+2、发帖旅程+1`,
'幽灵竹筒': `幽灵竹筒
【入手条件】在线时间≥20小时
【商店售价】280金币
【等级1】4% 回帖血液+1、发帖血液+1▕▏升级条件：在线时间≥100小时
【等级2】8% 回帖血液+2、发帖血液+1▕▏升级条件：在线时间≥300小时
【 Max 】4% 回帖旅程+1 血液+1、发帖旅程+1 血液+1`,
'神秘的红茶': `神秘的红茶
【入手条件】无
【商店售价】77金币
【等级1】3% 回帖血液+1、发帖血液+1▕▏升级条件：消耗30血液
【等级2】7% 回帖血液+1▕▏升级条件：堕落≥33
【 Max 】7% 回帖血液+1 堕落+1`,
'种植土豆': `种植土豆
【入手条件】无
【商店售价】140金币
【等级1】2% 回帖血液+1▕▏升级条件：消耗25血液
【等级2】4% 回帖血液+1▕▏升级条件：知识≥ 5
【等级3】6% 回帖血液+1▕▏升级条件：消耗35血液
【等级4】8% 回帖血液+1▕▏升级条件：知识≥15
【等级5】10% 回帖血液+1、发帖血液+2▕▏升级条件：金币-88
【 Max 】3% 回帖血液+1`,
'用过的粪桶': `用过的粪桶
【入手条件】旅程≥10
【商店售价】111金币
【等级1】3% 回帖血液-2 金币+2▕▏升级条件：消耗30血液
【 Max 】6% 回帖血液-1 金币+2`,
'箭术卷轴': `箭术卷轴
【入手条件】无
【商店售价】70金币
【 Max 】4% 回帖血液+1、发帖血液+1`,
'【圣诞限定】心心念念小雪人': `【圣诞限定】心心念念小雪人
【入手条件】无
【商店售价】666金币
【 Max 】1% 发帖旅程+1 金币+5 血液+5 咒术+3 知识+1 灵魂+1`,
'魔法石碑': `魔法石碑
【入手条件】无
【商店售价】130金币
【 Max 】7% 回帖血液+1，发帖+1咒术`,
'远古石碑': `远古石碑
【入手条件】无
【商店售价】140金币
【 Max 】7% 回帖金币+1，发帖 +1 咒术`,
'冒险用面包': `冒险用面包
【入手条件】无
【商店售价】150金币
【等级1】6% 回帖血液+1▕▏升级条件：旅程≥18
【等级2】6% 回帖血液+2▕▏升级条件：血液-25
【 Max 】2% 回帖血液+2`,
'海螺号角': `海螺号角
【入手条件】旅程≥15
【商店售价】277金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗177血液
【等级2】10% 回帖金币+1▕▏升级条件：旅程≥77
【 Max 】10% 回帖金币+1、发帖旅程+1 金币+3`,
'沙漠神灯': `沙漠神灯
【入手条件】知识≥20
【商店售价】250金币
【等级1】2% 回帖咒术+1▕▏升级条件：消耗25咒术
【 Max 】3% 回帖咒术+1 知识+1、发帖咒术+1 知识+1`,
'冒险用指南针': `冒险用指南针
【入手条件】无
【商店售价】150金币
【 Max 】3% 回帖旅程+1`,
'暖心小火柴': `暖心小火柴
【入手条件】旅程≥15
【商店售价】333金币
【等级1】勋章博物馆资料暂缺
【等级2】11% 回帖金币+1 血液-1、发帖金币+2▕▏升级条件：消耗33血液
【等级3】11% 回帖金币-1 血液+1、发帖血液+2▕▏升级条件：消耗33血液
【 Max 】11% 回帖金币+1 血液+1、发帖血液+1 金币+1`,
'神秘的漂流瓶': `神秘的漂流瓶
【入手条件】旅程≥66
【商店售价】500金币
【等级1】无属性▕▏升级条件：消耗 1旅程
【等级2】无属性▕▏升级条件：消耗 1旅程
【等级3】无属性▕▏升级条件：消耗 1旅程
【等级4】无属性▕▏升级条件：消耗 1旅程
【等级5】无属性▕▏升级条件：消耗 1旅程
【等级6】无属性▕▏升级条件：消耗 1旅程
【等级7】无属性▕▏升级条件：消耗 1旅程
【等级8】无属性▕▏升级条件：消耗 1旅程
【等级9】无属性▕▏升级条件：消耗 1旅程
【等级10】无属性▕▏升级条件：消耗旅程-9
【 Max 】12% 发帖旅程+1 知识+1`,
'冒险用绷带': `冒险用绷带
【入手条件】无
【商店售价】211金币
【等级1】8% 回帖血液+1▕▏升级条件：血液-15
【等级2】6% 回帖血液+1▕▏升级条件：血液-20
【 Max 】4% 回帖血液+2`,
'宝箱内的球': `宝箱内的球
【入手条件】旅程≥15
【商店售价】350金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗100金币
【等级3】2% 回帖旅程+1 金币-1、发帖金币+2▕▏升级条件：知识≥60
【等级4】10% 回帖金币+2 血液-1、发帖金币+3▕▏升级条件：旅程≥77
【 Max 】12% 回帖金币+3 血液-1、发帖金币+3`,
'SCP-s-1889': `SCP-s-1889
【入手条件】旅程≥20
【商店售价】450金币
【等级1】无属性▕▏升级条件：消耗 1旅程
【等级2】无属性▕▏升级条件：消耗 1旅程
【等级3】无属性▕▏升级条件：消耗 1旅程
【等级4】无属性▕▏升级条件：消耗 1旅程
【等级5】无属性▕▏升级条件：消耗 1旅程
【等级6】无属性▕▏升级条件：消耗旅程-5
【 Max 】3% 回帖知识+1 血液+2`,
'GHOST': `GHOST
【入手条件】堕落≥10
【商店售价】200金币
【等级1】1% 回帖血液-1 金币+1、发帖血液-1 金币+1▕▏升级条件：消耗10血液
【等级2】2% 回帖血液-1 金币+1、发帖血液-1 金币+1▕▏升级条件：消耗10血液
【等级3】3% 回帖血液-1 金币+1、发帖血液-1 金币+1▕▏升级条件：消耗10血液
【等级4】4% 回帖血液-1 金币+2、发帖血液-1 金币+2▕▏升级条件：消耗10血液
【等级5】5% 回帖血液-1 金币+2、发帖血液-1 金币+2▕▏升级条件：消耗10血液
【等级6】6% 回帖血液-1 金币+2、发帖血液-1 金币+2▕▏升级条件：消耗10血液
【 Max 】7% 回帖血液-1 金币+3、发帖血液-1 金币+3`,
'GM論壇初心者勛章': `GM論壇初心者勛章
【入手条件】无
【商店售价】100金币
【等级1】15% 回帖金币+1 血液+1、发帖金币+3 血液+3▕▏升级条件：在线时间≥72
【等级2】12% 回帖金币+1 血液+1、发帖金币+3 血液+3▕▏升级条件：在线时间≥150
【等级3】8% 回帖金币+1 血液+1、发帖金币+3 血液+3▕▏升级条件：在线时间≥280
【等级4】5% 回帖金币+1 血液+1、发帖金币+3 血液+3▕▏升级条件：在线时间≥560
【 Max 】2% 回帖金币+1 血液+1、发帖金币+5 血液+5`,
'社畜专用闹钟': `社畜专用闹钟
【入手条件】无
【商店售价】150金币
【等级1】20% 回帖金币+1 血液-1▕▏升级条件：金币＞996
【 Max 】20% 回帖金币-1 血液+1`,
'冒险用宝箱': `冒险用宝箱
【入手条件】无
【商店售价】200金币
【等级1】20% 回帖金币+1 血液-1▕▏升级条件：金币＞996
【等级2】5% 回帖血液+1、发帖旅程+1▕▏升级条件：消耗15咒术
【 Max 】10% 回帖血液+1、发帖知识+1`,
'羽毛笔': `羽毛笔
【入手条件】无
【商店售价】280金币
【等级1】1% 回帖旅程+1 血液+1▕▏升级条件：消耗33血液
【等级2】2% 回帖旅程+1 血液+1▕▏升级条件：消耗66血液
【等级3】3% 回帖旅程+1 血液+1▕▏升级条件：消耗99血液
【 Max 】4% 回帖旅程+1 血液+1`,
'超级无敌名贵金卡': `超级无敌名贵金卡
【入手条件】无
【商店售价】688金币
【 Max 】神秘属性`,
'One Ring': `One Ring
【入手条件】旅程≥25
【商店售价】500金币
【等级1】无属性▕▏升级条件：消耗200金币
【等级2-10】无属性▕▏升级条件：获得堕落1
【等级11】无属性▕▏升级条件：消耗堕落10
【 Max 】50% 发帖血液+1 堕落-1`,
'秘密空瓶': `秘密空瓶
【入手条件】追随≥42
【商店售价】666金币
【等级1】15% 回帖血液+1▕▏升级条件：消耗 1灵魂
【 Max 】100% 发帖金币+2 血液+1`,
'梦中的列车': `梦中的列车
【入手条件】旅程≥25
【商店售价】350金币
【等级1-10】无属性▕▏升级条件：消耗 1旅程
【等级11】无属性▕▏升级条件：获得 10旅程
【 Max 】3% 回帖知识+1、发帖知识+1`,
'冒险专用绳索': `冒险专用绳索
【入手条件】堕落＞10
【商店售价】220金币
【等级1】4% 回帖堕落+1▕▏升级条件：堕落≥66
【 Max 】8% 回帖堕落+1 金币+1`,
'赫尔墨斯·看守者之杖': `赫尔墨斯·看守者之杖
【入手条件】知识≥ 8
【商店售价】288金币
【等级1】3% 回帖血液+1▕▏升级条件：消耗200血液
【等级2】1% 回帖知识+1▕▏升级条件：知识≥20
【等级3】8% 回帖知识+1 堕落+2、发帖知识+1 堕落+2▕▏升级条件：堕落≥30
【等级4】6% 回帖知识+1 堕落+1、发帖知识+1 堕落+1▕▏升级条件：堕落≥60
【等级5】4% 回帖知识+1 堕落+1、发帖知识+1 堕落+1▕▏升级条件：堕落≥90
【 Max 】2% 回帖知识+1 血液-1、发帖知识+1 血液-1`,
'巴啦啦小魔仙棒': `巴啦啦小魔仙棒
【入手条件】无
【商店售价】130金币
【等级1】3% 回帖知识+1▕▏升级条件：知识≥13
【等级2】6% 回帖咒术+1▕▏升级条件：消耗39咒术
【 Max 】9% 回帖咒术+1、发帖咒术+1`,
'十字军护盾': `十字军护盾
【入手条件】无
【商店售价】190金币
【 Max 】8% 回帖金币+1、发帖金币+1`,
'龙血之斧': `龙血之斧
【入手条件】无
【商店售价】210金币
【 Max 】15% 发帖血液+3`,
'蔷薇骑士之刃': `蔷薇骑士之刃
【入手条件】追随≥10
【商店售价】320金币
【等级1】4% 回帖金币+1 血液+1、发帖知识+1▕▏升级条件：追随≥87
【 Max 】8% 回帖金币+1 血液+1、发帖知识+1`,
'狩猎用小刀': `狩猎用小刀
【入手条件】知识≥10
【商店售价】230金币
【等级1】4% 回帖堕落+1▕▏升级条件：消耗100血液
【等级2】8% 回帖血液+2▕▏升级条件：堕落-5
【等级3】8% 回帖金币+2▕▏升级条件：堕落-5
【 Max 】4% 回帖堕落+1、发帖旅程+1`,
'钢铁勇士弯刀': `钢铁勇士弯刀
【入手条件】无
【商店售价】140金币
【 Max 】4% 回帖金币+1 堕落-1`,
'海盗弯钩': `海盗弯钩
【入手条件】无
【商店售价】130金币
【 Max 】4% 回帖血液+1 堕落+1`,
'生锈的海盗刀枪': `生锈的海盗刀枪
【入手条件】堕落≥15
【商店售价】310金币
【等级1】5% 回帖堕落+1、发帖金币+3▕▏升级条件：旅程≥60
【等级2】10% 回帖堕落+1、发帖金币+3▕▏升级条件：消耗180金币
【 Max 】15% 回帖堕落+1、发帖金币+3`,
'日荒戒指': `日荒戒指
【入手条件】无
【商店售价】300金币
【等级1】5% 回帖金币+1、发帖金币+2▕▏升级条件：消耗88金币
【 Max 】10% 回帖金币+1、发帖金币+2`,
'月陨戒指': `月陨戒指
【入手条件】无
【商店售价】300金币
【等级1】5% 回帖血液+1、发帖血液+1▕▏升级条件：消耗88血液
【 Max 】10% 回帖血液+1、发帖血液+2`,
'星芒戒指': `星芒戒指
【入手条件】无
【商店售价】300金币
【等级1】4% 回帖咒术+1、发帖咒术+1▕▏升级条件：消耗18咒术
【 Max 】8% 回帖咒术+1、发帖咒术+1`,
'琉璃玉坠': `琉璃玉坠
【入手条件】无
【商店售价】180金币
【等级1】7% 回帖金币+1 ▕▏升级条件：消耗88血液
【 Max 】7% 回帖血液+1 金币+1`,
'武士之魂': `武士之魂
【入手条件】知识≥30
【商店售价】999金币
【等级1】勋章博物馆资料暂缺
【等级2】12% 回帖血液+2、发帖血液+3▕▏升级条件：消耗130血液
【等级3】15% 回帖血液+2 金币+1、发帖旅程+1▕▏升级条件：消耗 1灵魂
【 Max 】2% 回帖旅程+1 知识+1 金币+1 血液+3、发帖灵魂+1`,
'力量腕带': `力量腕带
【入手条件】无
【商店售价】125金币
【 Max 】8% 回帖金币+1`,
'物理学圣剑': `物理学圣剑
【入手条件】无
【商店售价】188金币
【 Max 】6% 发帖血液+1 知识+1`,
'男用贞操带': `男用贞操带
【入手条件】无
【商店售价】180金币
【 Max 】3% 回帖旅程+1 堕落-1`,
'贤者头盔': `贤者头盔
【入手条件】知识≥ 1
【商店售价】200金币
【等级1】8% 回帖金币-1 咒术+1、发帖金币+1▕▏升级条件：消耗100血液
【等级2】10% 回帖血液-1 咒术+1、发帖咒术+1▕▏升级条件：消耗100金币
【 Max 】8% 回帖咒术+1、发帖知识+1`,
'恩惠护符': `恩惠护符
【入手条件】旅程≥10
【商店售价】250金币
【等级1】3% 回帖金币+1、发帖金币+1▕▏升级条件：消耗350金币
【等级2】6% 回帖金币+2，发帖金币+3▕▏升级条件：旅途≥69
【 Max 】9% 回帖金币+3、发帖金币+5`,
'超级幸运无敌辉石': `超级幸运无敌辉石
【入手条件】无
【商店售价】1088金币
【等级1】1% 回帖血液+5、发帖血液+5▕▏升级条件：消耗1188血液
【 Max 】1% 回帖金币+20、发帖金币+20`,
'安杜因·乌瑞恩': `安杜因·乌瑞恩
【入手条件】旅程≥10
【商店售价】480金币
【等级1】10% 发帖堕落-1▕▏升级条件：血液≥200
【等级2】10% 回帖堕落-1 、发帖堕落-1▕▏升级条件：咒术≥40
【等级3】5% 回帖堕落-1、发帖堕落-1 血液+1▕▏升级条件：消耗280血液
【 Max 】13% 回帖堕落-1 血液+2、发帖堕落-1 血液+3`,
'羅素·托維': `羅素·托維
【入手条件】无
【商店售价】240金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗50血液
【等级2】5% 回帖金币+1、发帖金币+1▕▏升级条件：金币≥100
【等级3】15% 回帖金币+3、发帖金币+3▕▏升级条件：金币≥200
【等级4】10% 回帖金币+2、发帖金币+2▕▏升级条件：金币≥300
【 Max 】5% 回帖金币+1 血液+1、发帖金币+1 血液+1`,
'蓝礼·拜拉席恩': `蓝礼·拜拉席恩
【入手条件】堕落≤35
【商店售价】520金币
【等级1】5% 回帖金币+1、发帖金币+2▕▏升级条件：主题≥ 5
【等级2】10% 回帖金币+1 血液+1、发帖金币+2▕▏升级条件：追随≥22
【等级3】10% 回帖金币+1 血液+1、发帖旅程+1 金币+2▕▏升级条件：金币≥520
【等级4】5% 回帖血液-1、发帖血液-1▕▏升级条件：消耗520金币
【 Max 】13% 回帖金币+1 血液+1、发帖金币+2 血液+2`,
'阿列克西欧斯（Alexios）': `阿列克西欧斯（Alexios）
【入手条件】无
【商店售价】400金币
【等级1】3% 发帖知识+1▕▏升级条件：主题≥10
【等级2】3% 回帖堕落-1 血液+1、发帖知识+1▕▏升级条件：消耗200金币
【等级3】5% 回帖堕落-1 血液+1、发帖知识+1▕▏升级条件：消耗220血液
【等级4】7% 回帖堕落-1 血液+2、发帖知识+1▕▏升级条件：知识-3
【等级5】7% 发帖知识+1▕▏升级条件：知识≥50
【 Max 】10% 回帖堕落-1 血液+2、发帖堕落-1 血液+3`,
'莱因哈特·威尔海姆': `莱因哈特·威尔海姆
【入手条件】无
【商店售价】449金币
【等级1】勋章博物馆资料暂缺
【等级2】7% 回帖血液+1、发帖旅程+1 血液+2▕▏升级条件：旅程≥61
【等级3】资料暂缺
【等级4】资料暂缺
【 Max 】10% 回帖血液+2、发帖旅程+1 血液+3`,
'尼克斯·乌尔里克': `尼克斯·乌尔里克
【入手条件】堕落≤39
【商店售价】520金币
【等级1】6% 回帖血液+1、发帖咒术+1▕▏升级条件：咒术≥15
【等级2】6% 回帖血液+2、发帖咒术+1▕▏升级条件：消耗333金币
【等级3】10% 回帖血液+2、发帖咒术+2▕▏升级条件：消耗333血液
【等级4】14% 回帖堕落-1 血液+1、发帖堕落-2 血液+1▕▏升级条件：血液≥1000
【等级5】18% 回帖咒术+1 血液-1、发帖咒术+3 血液-3▕▏升级条件：堕落≥13
【 Max 】10% 发帖堕落-1`,
'乔纳森·里德': `乔纳森·里德
【入手条件】血液≥50
【商店售价】360金币
【等级1】3% 回帖血液+1▕▏升级条件：消耗200血液
【等级2】6% 回帖血液+1▕▏升级条件：发帖数≥300
【等级3】9% 回帖血液+2▕▏升级条件：知识≥40
【等级4】12% 回帖血液+2 金币-1、发帖知识+1▕▏升级条件：消耗365血液
【 Max 】15% 回帖血液+3 金币-1、发帖知识+1`,
'藤田優馬': `藤田優馬
【入手条件】主题≥ 3
【商店售价】298金币
【等级1】3% 回帖金币+1、发帖金币+2▕▏升级条件：消耗129金币
【等级2】9% 回帖堕落+1 金币-1、发帖堕落+2▕▏升级条件：消耗129血液
【 Max 】9% 回帖血液+1 堕落-1、发帖血液+2`,
'莫瑞甘': `莫瑞甘
【入手条件】咒术≥40
【商店售价】360金币
【等级1】3% 回帖堕落+1▕▏升级条件：消耗150金币
【等级2】5% 回帖咒术+1▕▏升级条件：消耗220金币
【等级3】7% 回帖咒术+1 堕落+1 血液-1▕▏升级条件：旅程≥60
【等级4】10% 回帖咒术+1 血液-2、发帖血液-2 咒术+2▕▏升级条件：消耗200血液
【 Max 】10% 回帖咒术+1 血液-1、发帖血液-3 咒术+3`,
'迈克尔迈尔斯': `迈克尔迈尔斯
【入手条件】旅程≥10
【商店售价】450金币
【等级1】3% 回帖血液+1、发帖堕落+1▕▏升级条件：消耗200血液
【等级2】5% 回帖血液+2、发帖堕落+1 血液+1▕▏升级条件：主题≥20
【等级3】7% 回帖血液+1 堕落+1、发帖堕落+1 血液+2▕▏升级条件：堕落≥40
【 Max 】10% 回帖血液+2 堕落+1、发帖堕落+1 血液+3`,
'Doc': `Doc
【入手条件】旅程≥10
【商店售价】500金币
【等级1】3% 回帖金币+1、发帖金币+1▕▏升级条件：旅程≥20
【等级2】5% 回帖金币+1 血液-1、发帖金币+2 血液-1▕▏升级条件：知识≥10
【等级3】8% 回帖金币+1、发帖金币+2▕▏升级条件：消耗250金币
【 Max 】10% 回帖金币+2 血液+1、发帖金币+2 知识+1`,
'杰克·莫里森/士兵 76': `杰克·莫里森/士兵 76
【入手条件】无
【商店售价】476金币
【等级1】3% 回帖血液+1▕▏升级条件：堕落≥30
【等级2】6% 回帖血液+1、发帖旅程+1▕▏升级条件：堕落≥76
【等级3】76% 回帖血液+3 堕落+2、发帖血液+7 金币+6 堕落+2▕▏升级条件：堕落≥77
【等级4】12% 回帖血液+2 金币-1、发帖旅程+1▕▏升级条件：消耗376血液
【 Max 】15% 回帖血液+3 金币-1、发帖旅程+1`,
'索林·橡木盾': `索林·橡木盾
【入手条件】追随≥14
【商店售价】520金币
【等级1】5% 回帖血液+1、发帖旅程+1▕▏升级条件：旅程≥15
【等级2】7% 回帖血液+1、发帖旅程+1▕▏升级条件：消耗333血液
【等级3】10% 回帖血液+2、发帖旅程+1▕▏升级条件：旅程-1
【等级4】12% 回帖血液+2、发帖旅程+1▕▏升级条件：金币≥1314
【等级5】15% 回帖金币+1 血液-1、发帖金币+3 血液-3▕▏升级条件：消耗1314金币
【 Max 】18% 回帖血液+3、发帖血液+5`,
'陷阱杀手': `陷阱杀手
【入手条件】堕落≥10
【商店售价】280金币
【等级1】3% 回帖血液+1、发帖血液+1▕▏升级条件：消耗134金币
【等级2】5% 回帖堕落+1、发帖堕落+1▕▏升级条件：堕落≥30
【 Max 】8% 回帖血液+2、发帖血液+2`,
'吉姆·霍普': `吉姆·霍普
【入手条件】在线时间≥100
【商店售价】300金币
【等级1】25% 回帖血液+1▕▏升级条件：血液≥35
【等级2】6% 回帖血液+1 堕落+1▕▏升级条件：消耗100血液
【等级3】8% 回帖血液+1 堕落+1▕▏升级条件：追随≥50
【等级4】10% 回帖血液+1 堕落+1▕▏升级条件：消耗250金币
【 Max 】12% 回帖血液+2 堕落+1`,
'沃特·沙利文': `沃特·沙利文
【入手条件】堕落≥24
【商店售价】302金币
【等级1】2% 回帖血液+2▕▏升级条件：消耗173金币
【等级2】4% 回帖血液+2、发帖咒术+1▕▏升级条件：追随≥40
【等级3】6% 回帖咒术+1、发帖咒术+1▕▏升级条件：旅程≥60
【等级4】8% 回帖咒术+1、发帖咒术+1▕▏升级条件：知识≥60
【等级5】8% 回帖咒术+1、发帖咒术+1 血液+1▕▏升级条件：堕落≥91
【 Max 】8% 回帖咒术+1 血液+1、发帖咒术+1 血液+1`,
'塞巴斯蒂安·斯坦': `塞巴斯蒂安·斯坦
【入手条件】无
【商店售价】450金币
【等级1】5% 回帖金币+1▕▏升级条件：追随≥50
【 Max 】8% 回帖金币+2、发帖金币+2`,
'魯杰羅·弗雷迪': `魯杰羅·弗雷迪
【入手条件】堕落≥30
【商店售价】300金币
【等级1】1% 回帖血液+3 堕落-1、发帖血液+3 堕落-1▕▏升级条件：消耗100血液
【等级2】2% 回帖血液+3 堕落-1、发帖知识+1 堕落-1▕▏升级条件：主题≥30
【等级3】2% 回帖知识+1 血液+1 堕落-1、发帖知识+1 血液+3▕▏升级条件：主题≥60
【 Max 】3% 回帖知识+1 血液+1 堕落-1、发帖知识+1 血液+5`,
'莎伦': `莎伦
【入手条件】知识≥10
【商店售价】350金币
【等级1】4% 回帖血液+1▕▏升级条件：堕落≥50
【等级2】4% 回帖血液+1 咒术+1▕▏升级条件：消耗50咒术
【 Max 】10% 回帖金币+2`,
'疾风剑豪': `疾风剑豪
【入手条件】无
【商店售价】450金币
【等级1】3% 回帖血液+1▕▏升级条件：旅程≥20
【等级2】6% 回帖血液+1▕▏升级条件：堕落≥50
【等级3】8% 回帖血液+1、发帖旅程+1▕▏升级条件：追随≥100
【等级4】10% 回帖血液+1 金币+1、发帖旅程+1▕▏升级条件：消耗300金币
【等级5】13% 回帖血液+1 金币+1、发帖旅程+1▕▏升级条件：灵魂≥ 1
【 Max 】5% 回帖旅程+1`,
'【新手友好】昆進': `【新手友好】昆進
【入手条件】无
【商店售价】250金币
【等级1】20% 回帖金币+1 血液+1、发帖金币+3 血液+3▕▏升级条件：总积分≥20
【等级2】15% 回帖金币+1 血液+1、发帖金币+3 血液+3▕▏升级条件：总积分≥35
【等级3】10% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：总积分≥50
【 Max 】5% 回帖金币+1 血液+1、发帖金币+1 血液+1`,
'萨菲罗斯': `萨菲罗斯
【入手条件】在线时间＞150小时
【商店售价】440金币
【等级1】4% 回帖血液+1、发帖血液+1▕▏升级条件：消耗130金币
【等级2】7% 回帖堕落+1、发帖血液+2▕▏升级条件：消耗40咒术
【等级3】8% 回帖血液+1 堕落+1、发帖血液+2 堕落+1▕▏升级条件：堕落≥100
【等级4】10% 回帖血液+1 堕落+1、发帖血液+3▕▏升级条件：堕落≥150
【等级5】12% 回帖血液+3 金币-1、发帖堕落+3▕▏升级条件：旅程≥100
【等级6】14% 回帖血液+2 堕落+1、发帖血液+3▕▏升级条件：知识≥150
【 Max 】16% 回帖血液+3 堕落+1、发帖血液+4`,
'丹·安博尔': `丹·安博尔
【入手条件】无
【商店售价】300金币
【等级1】3% 回帖血液+1、发帖血液+2▕▏升级条件：追随≥10（推测）
【等级2】4% 回帖金币+1 血液+1、发帖金币+1 血液+2▕▏升级条件：追随≥50
【等级3】5% 回帖金币+1 血液+1、发帖金币+2 血液+2▕▏升级条件：消耗260血液
【 Max 】6% 回帖金币+1 血液+2、发帖金币+2 血液+3`,
'汤姆·赫兰德': `汤姆·赫兰德
【入手条件】知识≥ 5
【商店售价】450金币
【等级1】4% 回帖血液+1▕▏升级条件：消耗50金币
【等级2】8% 回帖血液+1、发帖知识+1▕▏升级条件：知识≥20
【等级3】10% 回帖血液+1、发帖知识+1▕▏升级条件：旅程≥50
【 Max 】12% 回帖血液+1、发帖知识+1`,
'超人': `超人
【入手条件】堕落＜500
【商店售价】450金币
【等级1】4% 回帖金币+1、堕落-1、发帖血液+1▕▏升级条件：血液≥200
【等级2】6% 回帖金币+1、堕落-1、发帖血液+1▕▏升级条件：血液≥400
【等级3】8% 回帖金币+2、发帖血液+2▕▏升级条件：血液≥600
【 Max 】10% 回帖金币+3、发帖血液+3`,
'阿尔伯特·威斯克': `阿尔伯特·威斯克
【入手条件】知识≥10
【商店售价】400金币
【等级1】3% 回帖血液+1、发帖血液+1▕▏升级条件：消耗100金币
【等级2】5% 回帖血液+1、发帖血液+1▕▏升级条件：堕落≥30
【等级3】8% 回帖血液+1、发帖血液+2▕▏升级条件：知识≥50
【等级4】10% 回帖血液+1、发帖知识+1▕▏升级条件：知识≥100
【 Max 】13% 回帖血液+2、发帖知识+1`,
'鬼王酒吞童子': `鬼王酒吞童子
【入手条件】在线时间≥100小时
【商店售价】300金币
【等级1】4% 回帖血液+1▕▏升级条件：消耗50金币
【等级2】勋章博物馆资料暂缺
【等级3】8% 回帖血液+1、发帖堕落+1▕▏升级条件：堕落≥50
【 Max 】10% 回帖血液+1、发帖堕落+2`,
'Scott Ryder': `Scott Ryder
【入手条件】无
【商店售价】400金币
【等级1】4% 回帖金币+2▕▏升级条件：消耗80血液
【等级2】4% 回帖金币+2、发帖旅程+1▕▏升级条件：追随≥40
【等级3】6% 回帖金币+2、发帖旅程+1▕▏升级条件：消耗120金币
【 Max 】8% 回帖金币+2、发帖旅程+1`,
'汉克/Hank': `汉克/Hank
【入手条件】主题≥ 5
【商店售价】500金币
【等级1】5% 回帖血液+1▕▏升级条件：知识≥20
【等级2】7% 回帖血液+1、发帖血液+1▕▏升级条件：追随≥40
【等级3】9% 回帖血液+1、发帖血液+2▕▏升级条件：旅程≥60
【等级4】11% 回帖血液+1、发帖血液+3▕▏升级条件：消耗500血液
【等级5】13% 回帖血液+1、发帖旅程+1▕▏升级条件：消耗500金币
【 Max 】25% 回帖血液+1、发帖旅程+1`,
'三角头': `三角头
【入手条件】主题≥20
【商店售价】450金币
【等级1】6% 回帖血液+1、发帖堕落+1▕▏升级条件：主题≥20
【等级2】8% 回帖血液+2、发帖堕落+1▕▏升级条件：堕落≥50
【 Max 】11% 回帖血液+2、发帖堕落+1 血液+2`,
'幻象': `幻象
【入手条件】追随≥20
【商店售价】350金币
【等级1】3% 回帖金币+1、发帖金币+1▕▏升级条件：追随≥40
【等级2】6% 回帖金币+1、发帖金币+2▕▏升级条件：知识≥40
【等级3】8% 回帖金币+2、发帖金币+2▕▏升级条件：消耗200金币
【 Max 】10% 回帖金币+2、发帖金币+3`,
'金刚狼': `金刚狼
【入手条件】在线时间≥240小时
【商店售价】400金币
【等级1】5% 回帖堕落+1▕▏升级条件：堕落≥10
【等级2】5% 回帖金币+1 血液+1▕▏升级条件：金币≥500
【等级3】8% 回帖金币+1 血液+1▕▏升级条件：血液≥500
【 Max 】10% 回帖金币+1 血液+1 堕落-1`,
'克苏鲁': `克苏鲁
【入手条件】堕落≥15
【商店售价】666金币
【等级1】4% 回帖堕落+1、发帖堕落+1▕▏升级条件：堕落≥33
【等级2】6% 回帖堕落+1、发帖知识+1▕▏升级条件：消耗666血液
【等级3】8% 回帖堕落+2、发帖堕落+1 堕落+1▕▏升级条件：知识≥33
【等级4】10% 回帖堕落+1 血液+1、发帖堕落+1▕▏升级条件：消耗 1灵魂
【 Max 】33% 回帖堕落+1 血液+1、发帖堕落+2 血液+2`,
'士官长': `士官长
【入手条件】旅程≥10
【商店售价】450金币
【等级1】6% 回帖金币+1、发帖旅程+1▕▏升级条件：消耗200血液
【等级2】8% 回帖金币+2 血液-1、发帖旅程+1▕▏升级条件：旅程≥50
【 Max 】11% 回帖血液+3 金币-1、发帖旅程+1`,
'托尼·史塔克': `托尼·史塔克
【入手条件】旅程≥20
【商店售价】650金币
【等级1】5% 回帖血液+1、发帖血液+1▕▏升级条件：消耗50血液
【等级2】6% 回帖血液+2、发帖血液+2▕▏升级条件：消耗100金币
【等级3】7% 回帖血液+2、发帖血液+3▕▏升级条件：旅程≥40
【等级4】8% 回帖血液+2、发帖知识+1▕▏升级条件：消耗150金币
【等级5】9% 回帖血液+2、发帖知识+1▕▏升级条件：知识≥20
【等级6】10% 回帖血液+2、发帖知识+1 血液+1▕▏升级条件：消耗200金币
【等级7】11% 回帖血液+3 金币-1、发帖知识+1 血液+2▕▏升级条件：消耗200血液
【等级8】12% 回帖血液+2 金币-1、发帖知识+1 血液+3▕▏升级条件：知识≥50
【等级9】15% 发帖知识+1 血液+5▕▏升级条件：消耗999血液
【 Max 】6% 回帖知识+1 血液+3、发帖知识+1 血液+5`,
'加勒特·霍克': `加勒特·霍克
【入手条件】无
【商店售价】300金币
【等级1】4% 回帖金币+1、发帖金币+2▕▏升级条件：消耗150血液
【等级2】6% 回帖金币+1、发帖金币+3▕▏升级条件：消耗200金币
【等级3】8% 回帖金币+1 血液+1、发帖金币+3▕▏升级条件：追随≥100
【 Max 】10% 回帖金币+1 血液+1、发帖旅程+1 金币+3`,
'艾吉奥': `艾吉奥
【入手条件】旅程≥15
【商店售价】500金币
【等级1】4% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：消耗200金币
【等级2】6% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：消耗200血液
【等级3】8% 回帖金币+2 血液+2、发帖金币+2 血液+1▕▏升级条件：消耗50咒术
【等级4】3% 回帖金币+1 旅程+1 血液+1、发帖金币+1 旅程+1 血液+1▕▏升级条件：知识≥50
【等级5】4% 回帖金币+2 旅程+1 血液+1、发帖金币+2 旅程+1 血液+1▕▏升级条件：知识≥120
【 Max 】4% 回帖金币+3 旅程+1 血液+1、发帖金币+3 旅程+1 血液+1`,
'Chris Mazdzer': `Chris Mazdzer
【入手条件】主题数≥ 5
【商店售价】300金币
【等级1】5% 回帖血液+1▕▏升级条件：消耗150金币
【等级2】7% 回帖血液+2▕▏升级条件：消耗200金币
【 Max 】10% 回帖血液+2`,
'索尔·奥丁森': `索尔·奥丁森
【入手条件】知识≥ 5
【商店售价】500金币
【等级1】2% 回帖咒术+1、发帖旅程+1▕▏升级条件：消耗88金币
【等级2】3% 回帖咒术+1 金币+1、发帖旅程+1▕▏升级条件：消耗88血液
【等级3】4% 回帖咒术+1 金币+1、发帖旅程+1▕▏升级条件：消耗120金币
【等级4】5% 回帖咒术+1 金币+2、发帖旅程+1▕▏升级条件：消耗66咒术
【等级5】6% 回帖咒术+1 金币+2、发帖旅程+1▕▏升级条件：消耗188金币
【等级6】7% 回帖咒术+1 金币+3、发帖旅程+1▕▏升级条件：旅程≥88
【 Max 】8% 回帖咒术+1 金币+3、发帖旅程+1`,
'绯红女巫': `绯红女巫
【入手条件】堕落≥10
【商店售价】400金币
【等级1】2% 回帖堕落+1、发帖咒术+1▕▏升级条件：消耗100血液
【等级2】4% 回帖堕落+1、发帖咒术+1▕▏升级条件：堕落≥33
【等级3】4% 回帖堕落+1 金币+1、发帖咒术+2▕▏升级条件：消耗66咒术
【等级4】6% 回帖堕落+1 金币+1、发帖咒术+2▕▏升级条件：堕落≥88
【等级5】8% 回帖堕落+1 金币+2、发帖咒术+2▕▏升级条件：知识≥88
【 Max 】10% 回帖堕落+1 金币+2、发帖咒术+2`,
'泰比里厄斯': `泰比里厄斯
【入手条件】咒术≥35
【商店售价】555金币
【等级1】5% 回帖血液+1、发帖咒术+1▕▏升级条件：消耗355金币
【等级2】10% 回帖金币+1、发帖咒术+1▕▏升级条件：消耗255血液
【等级3】12% 回帖血液+1、发帖咒术+1▕▏升级条件：咒术≥155
【 Max 】15% 回帖血液+2、发帖旅程+1 咒术+1`,
'大古': `大古
【入手条件】主题数≥20
【商店售价】300金币
【等级1】2% 回帖金币+1 血液+1▕▏升级条件：血液≥100
【等级2】4% 回帖金币+1 血液+1▕▏升级条件：消耗100血液
【等级3】6% 回帖金币+1 血液+1▕▏升级条件：堕落≥50
【等级4】8% 回帖血液+1 堕落+1▕▏升级条件：消耗200血液
【等级5】10% 回帖金币+1 血液+1▕▏升级条件：血液≥666
【 Max 】12% 回帖金币+1 血液+1、发帖旅程+1`,
'炙热的格拉迪欧拉斯': `炙热的格拉迪欧拉斯
【入手条件】主题数≥15
【商店售价】666金币
【等级1】25% 回帖血液+2▕▏升级条件：咒术≥66
【 Max 】50% 回帖血液+1`,
'格拉迪欧拉斯': `格拉迪欧拉斯
【入手条件】血液≥100
【商店售价】450金币
【等级1】2% 回帖血液+1▕▏升级条件：消耗80金币
【等级2】4% 回帖血液+1▕▏升级条件：追随≥50
【等级3】8% 回帖血液+1、发帖血液+1▕▏升级条件：消耗120金币
【等级4】11% 回帖血液+2、发帖血液+2▕▏升级条件：消耗330金币
【 Max 】14% 回帖血液+2、发帖知识+1 血液+2`,
'卡洛斯·奥利维拉': `卡洛斯·奥利维拉
【入手条件】追随≥10
【商店售价】600金币
【等级1】4% 回帖金币+1▕▏升级条件：消耗200血液
【等级2】4% 回帖咒术+1▕▏升级条件：知识≥20
【等级3】6% 回帖金币+1 咒术+1▕▏升级条件：消耗500金币
【等级4】8% 回帖金币+1 咒术+1、发帖旅程+1▕▏升级条件：消知识≥100
【 Max 】10% 回帖金币+2 咒术+1 血液-1、发帖旅程+1`,
'巴基 (猎鹰与冬兵)': `巴基 (猎鹰与冬兵)
【入手条件】无
【商店售价】500金币
【等级1】4% 回帖血液+1、发帖血液+1▕▏升级条件：消耗100血液
【等级2】6% 回帖血液+1、发帖血液+1▕▏升级条件：消耗200血液
【等级3】8% 回帖血液+2、发帖血液+2▕▏升级条件：消耗400血液
【 Max 】12% 回帖血液+3、发帖血液+3`,
'Joker': `Joker
【入手条件】追随≥ 1
【商店售价】400金币
【等级1】6% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：追随≥30
【等级2】8% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：追随≥60
【等级3】10% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：追随≥90
【等级4】2% 回帖旅程+1 知识+1、发帖旅程+1 知识+1▕▏升级条件：追随≥180
【 Max 】3% 回帖旅程+1 知识+1、发帖旅程+1 知识+1`,
'V (DMC5)': `V (DMC5)
【入手条件】堕落≤42
【商店售价】500金币
【等级1】4% 回帖堕落-1、发帖血液+2▕▏升级条件：金币≥200
【等级2】6% 回帖堕落-1、发帖血液+2▕▏升级条件：知识≥30
【等级3】8% 回帖血液+1 堕落-1、发帖血液+2▕▏升级条件：消耗150金币
【等级4】10% 回帖血液+1 堕落-1、发帖血液+2▕▏升级条件：消耗150血液
【等级5】13% 回帖血液+1 堕落-1、发帖血液+2▕▏升级条件：消耗66咒术
【 Max 】13% 回帖血液+2 堕落-1、发帖血液+3`,
'Dante': `Dante
【入手条件】主题数≥ 5
【商店售价】666金币
【等级1】4% 回帖血液+1、发帖血液+1▕▏升级条件：消耗150金币
【等级2】6% 回帖血液+1、发帖血液+1▕▏升级条件：消耗150血液
【等级3】8% 回帖血液+1、发帖血液+1▕▏升级条件：旅程≥50
【等级4】10% 回帖血液+1、发帖血液+1▕▏升级条件：消耗88咒术
【等级5】12% 回帖血液+2、发帖血液+2▕▏升级条件：血液≥666
【等级6】15% 回帖血液+2 堕落-1、发帖血液+2▕▏升级条件：血液≥999
【 Max 】13% 回帖金币+3、发帖血液+3`,
'Vergil': `Vergil
【入手条件】咒术≥15
【商店售价】500金币
【等级1】4% 回帖血液+1、发帖血液+2▕▏升级条件：消耗150金币
【等级2】4% 回帖血液+1、发帖咒术+2▕▏升级条件：追随≥50
【等级3】5% 回帖咒术+1、发帖咒术+2▕▏升级条件：消耗150血液
【等级4】6% 回帖咒术+1、发帖咒术+2▕▏升级条件：消耗88咒术
【等级5】8% 回帖咒术+1、发帖咒术+2▕▏升级条件：咒术≥130
【 Max 】15% 回帖血液+2、发帖咒术+3`,
'威克多尔·克鲁姆': `威克多尔·克鲁姆
【入手条件】血液≥100
【商店售价】300金币
【等级1】6% 回帖血液+1、发帖金币+1 咒术+1▕▏升级条件：消耗100金币
【等级2】8% 回帖血液+1、发帖金币+1 咒术+1▕▏升级条件：消耗150金币
【等级3】10% 回帖血液+1、发帖金币+1 咒术+1▕▏升级条件：消耗30咒术
【 Max 】10% 回帖金币+2、发帖金币+2 咒术+1`,
'赫敏·格兰杰': `赫敏·格兰杰
【入手条件】≥30
【商店售价】300金币
【等级1】6% 回帖血液+1、发帖 血液+1 咒术+1▕▏升级条件：消耗100血液
【等级2】8% 回帖血液+1、发帖血液+1 咒术+1▕▏升级条件：消耗150血液
【等级3】10% 回帖血液+1、发帖血液+1 咒术+1▕▏升级条件：消耗30咒术
【 Max 】10% 回帖血液+2、发帖血液+2 咒术+1`,
'阿拉贡': `阿拉贡
【入手条件】≥15
【商店售价】680金币
【等级1】10% 回帖血液+1、发帖血液+3▕▏升级条件：消耗365血液
【等级2】12% 回帖血液+1、发帖血液+3▕▏升级条件：旅程≥88
【等级3】12% 回帖血液+2、发帖旅程+1▕▏升级条件：追随≥365
【等级4】16% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗1413金币
【 Max 】18% 回帖血液+3、发帖旅程+1`,
'瑟兰迪尔': `瑟兰迪尔
【入手条件】在线≥99小时
【商店售价】400金币
【等级1】5% 回帖金币+1、发帖金币+3▕▏升级条件：消耗130金币
【等级2】8% 回帖金币+1、发帖金币+3▕▏升级条件：消耗130血液
【等级3】10% 回帖金币+1、发帖金币+3▕▏升级条件：知识≥40
【 Max 】10% 回帖金币+2、发帖金币+3`,
'异形': `异形
【入手条件】堕落≥20
【商店售价】580金币
【等级1】6% 回帖血液+1▕▏升级条件：堕落≥44
【等级2】8% 回帖血液+1▕▏升级条件：消耗188血液
【等级3】10% 回帖血液+2▕▏升级条件：追随≥108
【等级4】12% 回帖血液+2 金币-1▕▏升级条件：金币＞999
【 Max 】15% 回帖血液+3 金币-1、发帖旅程+1`,
'岛田源氏': `岛田源氏
【入手条件】旅程≥20
【商店售价】600金币
【等级1】6% 回帖血液+1、发帖血液+1▕▏升级条件：消耗300血液
【等级2】8% 回帖血液+1、发帖血液+1▕▏升级条件：消耗300金币
【等级3】10% 回帖血液+1、发帖血液+2▕▏升级条件：旅程≥60
【等级4】11% 回帖血液+1、发帖血液+3▕▏升级条件：消耗300血液
【等级5】13% 回帖血液+2、发帖血液+4▕▏升级条件：知识≥130
【 Max 】15% 回帖血液+3、发帖血液+5`,
'小天狼星·布莱克': `小天狼星·布莱克
【入手条件】堕落≤30
【商店售价】520金币
【等级1】10% 回帖血液+1、发帖血液+3▕▏升级条件：消耗123咒术
【等级2】8% 回帖血液-1 咒术+1、发帖血液-3 咒术+3▕▏升级条件：血液≥520
【 Max 】10% 回帖咒术+1、发帖知识+1 （一格）`,
'甘道夫': `甘道夫
【入手条件】知识≥18
【商店售价】700金币
【等级1】8% 回帖血液+1 、发帖知识+1▕▏升级条件：旅程≥60
【等级2】10% 发帖血液+2 知识+1▕▏升级条件：灵魂≥ 2
【等级3】1% 发帖灵魂+1▕▏升级条件：消耗 1点堕落
【等级4】12% 回帖血液+2、发帖咒术+1▕▏升级条件：消耗111咒术
【 Max 】15% 回帖血液+3、发帖咒术+2`,
'莱戈拉斯': `莱戈拉斯
【入手条件】无
【商店售价】300金币
【等级1】5% 回帖金币+1、发帖血液+1▕▏升级条件：消耗50金币
【等级2】6% 回帖金币+1、发帖血液+2▕▏升级条件：消耗50血液
【等级3】7% 回帖金币+2、发帖血液+2▕▏升级条件：消耗100金币
【 Max 】8% 回帖金币+2、发帖血液+3`,
'神灯': `神灯
【入手条件】无
【商店售价】300金币
【等级1】5% 回帖血液+1、发帖血液+1▕▏升级条件：消耗100金币
【等级2】8% 回帖血液+1、发帖血液+1▕▏升级条件：消耗150金币
【等级3】10% 回帖血液+1、发帖血液+1▕▏升级条件：消耗200金币
【等级4】12% 回帖血液+2、发帖血液+2▕▏升级条件：消耗300金币
【 Max 】8% 回帖血液+2 咒术+1、发帖血液+2 咒术+1`,
'黑豹': `黑豹
【入手条件】知识≥ 5
【商店售价】320金币
【等级1】6% 回帖血液+1 堕落-1、发帖咒术+1▕▏升级条件：消耗100血液
【等级2】8% 回帖血液+1 堕落-1、发帖咒术+1▕▏升级条件：消耗200金币
【等级3】10% 回帖血液+1 堕落-1、发帖咒术+1▕▏升级条件：消耗50咒术
【 Max 】12% 回帖血液+2 堕落-1、发帖咒术+2`,
'莱托·厄崔迪': `莱托·厄崔迪
【入手条件】无
【商店售价】350金币
【等级1】6% 回帖血液+2▕▏升级条件：消耗50金币
【等级2】8% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗50血液
【等级3】10% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗150金币
【 Max 】12% 回帖血液+2、发帖知识+1`,
'西弗勒斯·斯内普': `西弗勒斯·斯内普
【入手条件】旅程≥38
【商店售价】666金币
【等级1】12% 回帖血液+1、发帖旅程+1▕▏升级条件：消耗99血液
【等级2】10% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗99金币
【等级3】8% 回帖血液+3、发帖旅程+1▕▏升级条件：消耗1314血液
【等级4】6% 回帖旅程+1▕▏升级条件：金币≥999
【 Max 】2% 回帖旅程+1、发帖灵魂+1`,
'阿不思·邓布利多': `阿不思·邓布利多
【入手条件】旅程≥10
【商店售价】250金币
【等级1】6% 回帖血液+1、发帖血液+3▕▏升级条件：消耗333金币
【等级2】8% 回帖血液+1、发帖血液+3▕▏升级条件：消耗444血液
【等级3】10% 回帖血液+2、发帖血液+3▕▏升级条件：消耗77咒术
【等级4】15% 回帖血液 +2、发帖知识+1▕▏升级条件：旅程≥115
【 Max 】16% 回帖血液+3、发帖知识+1`,
'普隆普特·阿金塔姆': `普隆普特·阿金塔姆
【入手条件】知识≥10
【商店售价】500金币
【等级1】3% 回帖金币+1、发帖旅程+1▕▏升级条件：知识≥30
【等级2】6% 回帖金币+2、发帖旅程+1▕▏升级条件：消耗100金币
【等级3】9% 回帖金币+2、发帖旅程+1▕▏升级条件：消耗200金币
【等级4】12% 回帖金币+2、发帖旅程+1▕▏升级条件：咒术≥188
【 Max 】15% 回帖金币+2、发帖旅程+1`,
'诺克提斯·路西斯·伽拉姆': `诺克提斯·路西斯·伽拉姆
【入手条件】旅程≥15
【商店售价】666金币
【等级1】4% 回帖血液+1、发帖旅程+1▕▏升级条件：旅程≥30
【等级2】8% 回帖血液+1、发帖旅程+1▕▏升级条件：消耗200血液
【等级3】12% 回帖血液+1、发帖旅程+1▕▏升级条件：消耗350血液
【等级4】15% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗 1灵魂
【 Max 】18% 回帖血液+3、发帖旅程+1`,
'豹王': `豹王
【入手条件】无
【商店售价】400金币
【等级1】2% 回帖金币+2▕▏升级条件：追随≥50
【等级2】5% 回帖金币+2▕▏升级条件：消耗100金币
【等级3】8% 回帖金币+2、发帖旅程+1▕▏升级条件：消耗100血液
【 Max 】11% 回帖金币+2、发帖旅程+1`,
'不灭狂雷-沃利贝尔': `不灭狂雷-沃利贝尔
【入手条件】堕落≥20
【商店售价】500金币
【等级1】2% 回帖血液+1、发帖血液+2 堕落+1▕▏升级条件：消耗200血液
【等级2】5% 回帖血液+1 堕落+1、发帖血液+3 堕落+1▕▏升级条件：咒术≥100
【 Max 】10% 回帖血液+2 堕落+1、发帖血液+3 堕落+1`,
'桐生一马': `桐生一马
【入手条件】追随≥20
【商店售价】500金币
【等级1】8% 回帖金币+1▕▏升级条件：消耗200血液
【等级2】8% 回帖金币+1 血液+1▕▏升级条件：追随≥88
【 Max 】15% 回帖金币+1 血液+1`,
'大黄蜂（ChevroletCamaro）': `大黄蜂（ChevroletCamaro）
【入手条件】旅程≥10
【商店售价】300金币
【等级1】4% 回帖金币+1 血液+1、发帖咒术+1▕▏升级条件：消耗100金币
【等级2】6% 回帖金币+1 血液+1、发帖咒术+1▕▏升级条件：消耗100血液
【等级3】8% 回帖金币+1 血液+1、发帖咒术+1▕▏升级条件：消耗30咒术
【 Max 】10%  回帖血液+1 金币+1、发帖咒术+1`,
'博伊卡': `博伊卡
【入手条件】追随≥20
【商店售价】550金币
【等级1】5% 回帖金币+1、发帖金币+2▕▏升级条件：消耗200血液
【等级2】10% 回帖金币+1、发帖金币+2▕▏升级条件：消耗400血液
【等级3】10% 回帖金币+2 血液-1、发帖金币+3 血液-1▕▏升级条件：消耗金币-100
【等级4】13% 回帖金币+3 血液-1、发帖金币+5 血液-1▕▏升级条件：消耗600血液
【 Max 】15% 回帖金币+3、发帖金币+5`,
'史蒂文·格兰特': `史蒂文·格兰特
【入手条件】无
【商店售价】500金币
【等级1】4% 回帖金币+1、发帖血液+1▕▏升级条件：消耗100血液
【等级2】6% 回帖金币+1、发帖血液+1▕▏升级条件：消耗150金币
【等级3】8% 回帖金币+1、发帖血液+1▕▏升级条件：消耗200血液
【等级4】10% 回帖金币+2、发帖血液+2▕▏升级条件：消耗251金币
【等级5】12% 回帖金币+2、发帖血液+2▕▏升级条件：消耗400血液
【 Max 】14% 回帖金币+3、发帖血液+3`,
'马克·史贝特': `马克·史贝特
【入手条件】无
【商店售价】500金币
【等级1】4% 回帖血液+1、发帖金币+1▕▏升级条件：消耗100金币
【等级2】6% 回帖血液+1、发帖金币+1▕▏升级条件：消耗150血液
【等级3】8% 回帖血液+1、发帖金币+1▕▏升级条件：消耗200金币
【等级4】10% 回帖血液+2、发帖金币+2▕▏升级条件：消耗251血液
【等级5】12% 回帖血液+2、发帖金币+2▕▏升级条件：消耗400金币
【 Max 】14% 回帖血液+3、发帖金币+3`,
'果体76': `果体76
【入手条件】活动产出
【商店售价】766
【 Max 】76% 回帖血液+1`,
'竹村五郎': `竹村五郎
【入手条件】无
【商店售价】400金币
【等级1】5% 回帖咒术+1▕▏升级条件：消耗50咒术
【等级2】8% 回帖咒术+1▕▏升级条件：消耗100咒术
【 Max 】10% 回帖咒术+1`,
'光之战士': `光之战士
【入手条件】旅程≥15
【商店售价】600金币
【等级1】5% 回帖金币+1 发帖血液+2▕▏升级条件：消耗200金币
【等级2】8% 回帖金币+2 发帖血液+3▕▏升级条件：消耗300金币
【等级3】10% 回帖金币+2 发帖血液+3▕▏升级条件：消耗300血液
【等级4】12% 回帖血液+2 发帖金币+3▕▏升级条件：消耗400金币
【等级5】4% 回帖旅程+1 发帖金币+3▕▏升级条件：消耗500金币
【 Max 】5% 回帖旅程+1 发帖金币+5`,
'Drover': `Drover
【入手条件】无
【商店售价】380金币
【等级1】4% 回帖血液+1、发帖血液+1▕▏升级条件：消耗80血液
【等级2】4% 回帖血液+2、发帖血液+2▕▏升级条件：消耗180血液
【等级3】6% 回帖血液+2、发帖血液+2▕▏升级条件：消耗280血液
【 Max 】8% 回帖血液+3、发帖血液+3`,
'乔治·迈克尔': `乔治·迈克尔
【入手条件】旅程≥30
【商店售价】600金币
【等级1】6% 回帖血液+2、发帖血液+5▕▏升级条件：追随≥99
【等级2】9% 回帖血液+2、发帖血液+5▕▏升级条件：在线时间≥666
【等级3】12% 回帖血液+2、发帖血液+5▕▏升级条件：消耗666金币
【等级4】15% 回帖血液+2、发帖血液+5▕▏升级条件：消耗888血液
【 Max 】18% 回帖血液+3、发帖血液+5`,
'荒野大镖客：救赎 II': `荒野大镖客：救赎 II
【入手条件】无
【商店售价】100金币
【 Max 】1% 回帖旅程+1`,
'雾都血医': `雾都血医
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖血液+1`,
'寶可夢 Pokémon': `寶可夢 Pokémon
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖金币+1`,
'最终幻想XIV': `最终幻想XIV
【入手条件】无
【商店售价】100金币
【 Max 】1% 回帖旅程+1`,
'赛博朋克2077': `赛博朋克2077
【入手条件】无
【商店售价】100金币
【 Max 】1% 回帖旅程+1`,
'TRPG版塊': `TRPG版塊
【入手条件】完成TRPG版块内的跑团任务
【商店售价】100金币
【 Max 】2% 回帖咒术+1`,
'恶魔城': `恶魔城
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖血液+1`,
'英雄联盟': `英雄联盟
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖金币+1`,
'男巫之歌': `男巫之歌
【入手条件】金币≥888 追随≥100 知识≥20
【商店售价】100金币
【等级1】无属性▕▏升级条件：消耗150金币
【等级2】无属性▕▏升级条件：消耗150金币
【等级3】无属性▕▏升级条件：消耗150金币
【等级4】无属性▕▏升级条件：消耗150金币
【等级5】无属性▕▏升级条件：消耗150金币
【等级6】无属性▕▏升级条件：消耗150金币
【等级7】无属性▕▏升级条件：消耗旅程-1
【等级8】15% 回帖血液+1、发帖血液+1▕▏升级条件：消耗 1灵魂
【 Max 】50% 回帖血液+1、发帖血液+2`,
'时间管理局': `时间管理局
【入手条件】在线时间≥199 知识≥19 旅程≥19
【商店售价】100金币
【等级1】
【等级2】2% 回帖金币+2、发帖血液+2▕▏升级条件：在线时间≥1999
【等级3】3% 回帖咒术+1、发帖咒术+1▕▏升级条件：在线时间≥2999
【 Max 】3% 回帖旅程+1、发帖旅程+1`,
'男色诱惑': `男色诱惑
【入手条件】堕落≥100、知识≥50
【商店售价】无
【等级1】11% 发帖血液+3▕▏升级条件：堕落≥200
【等级2】22% 发帖血液+4▕▏升级条件：堕落≥300
【 Max 】33% 发帖血液+5`,
'美恐：启程': `美恐：启程
【入手条件】旅程≥15、知识≥15、血液≥200
【商店售价】100金币
【等级1】1% 回帖旅程+1▕▏升级条件：消耗1旅程
【等级2】2% 回帖血液+1▕▏升级条件：消耗50血液
【等级3】1% 回帖知识+1▕▏升级条件：消耗1旅程
【等级4】1% 回帖血液+2▕▏升级条件：消耗50金币
【等级5】1% 回帖旅程+1▕▏升级条件：消耗1旅程
【等级6】1% 回帖血液+2▕▏升级条件：消耗50血液
【等级7】2% 回帖血液+1▕▏升级条件：消耗50金币
【等级8】1% 回帖知识+1▕▏升级条件：获得1知识
【等级9】2% 回帖血液+2▕▏升级条件：获得3旅程
【等级10】3% 回帖旅程+1`,
'街头霸王': `街头霸王
【入手条件】无
【商店售价】100金币
【等级1】2% 回帖金币+1`,
//个人补充
//天赋/造诣
'海边的邻居': `海边的邻居
【入手条件】金币≥1500、追随≥150
【商店售价】无
【等级1】5% 发帖咒术+1▕▏升级条件：在线时间≥888
【等级2】15% 发帖咒术+1▕▏升级条件：知识≥60
【等级 Max 】30% 发帖咒术+1`,
'四季之歌': `四季之歌
【入手条件】旅程≥40、知识≥40、追随≥40、咒术≥40
【商店售价】无
【等级1】10% 回帖血液+1、发帖咒术+2▕▏升级条件：消耗咒术1卷
【等级2】10% 回帖金币+1、发帖旅程+1▕▏升级条件：消耗咒术1卷
【等级3】10% 回帖血液+1、发帖知识+1▕▏升级条件：消耗咒术1卷
【 Max 】10% 回帖金币+1、发帖知识+1`,
'风雪之家': `风雪之家
【入手条件】注册天数>=365、追随>=50
【商店售价】无
【 Max 】1% 回帖血液+5 金币+5、发帖灵魂+1`,
'龙鳞石': `龙鳞石
【入手条件】春节活动获取
【商店售价】无
【 Max 】1% 发帖金币+6`,
'『不败之花』': `『不败之花』
【入手条件】灵魂>=1并且堕落>=1
【商店售价】1血液
【等级】无属性`,
'约书亚・罗兹菲尔德': `约书亚・罗兹菲尔德
【入手条件】堕落>=160
【商店售价】500金币
【等级1】1% 回帖血液+1▕▏升级条件：1600金币
【等级2】2% 回帖血液+1 堕落+2、发帖灵魂+1 堕落+3▕▏升级条件：堕落>=16
【等级3】10% 回帖血液+3 堕落+1、发帖血液+3▕▏升级条件：堕落>=32
【等级4】10% 回帖血液+2、发帖血液+2▕▏升级条件：堕落>=80
【等级5】6% 回帖堕落-1、发帖堕落-1▕▏升级条件：堕落>=160
【等级6】8% 回帖堕落-1、发帖堕落-1▕▏升级条件：堕落>=250
【 Max 】10% 回帖堕落-2、发帖堕落-2`,
'克莱夫・罗兹菲尔德': `克莱夫・罗兹菲尔德
【入手条件】主题数>=16
【商店售价】622金币
【等级1】3% 回帖金币+1▕▏升级条件：消耗320金币
【等级2】5% 回帖金币+1▕▏升级条件：消耗480血液
【等级3】7% 回帖金币+2、发帖咒术+1▕▏升级条件：消耗640血液
【等级4】9% 回帖金币+2、发帖咒术+1▕▏升级条件：消耗640血液
【等级5】13% 回帖金币+2、发帖咒术+1▕▏升级条件：消耗1灵魂
【 Max 】16% 回帖金币+2 血液+1、发帖咒术+1`,
'苇名弦一郎': `苇名弦一郎
【入手条件】追随>=15
【商店售价】666金币
【等级1】3% 回帖咒术+1、发帖旅程+1▕▏升级条件：消耗666血液
【等级2】5% 回帖咒术+1、发帖旅程+1▕▏升级条件：消耗999血液
【等级3】8% 回帖咒术+1、发帖旅程+1▕▏升级条件：消耗169咒术
【 Max 】5% 回帖旅程+1、发帖咒术+2`,
'里昂（RE4）': `里昂（RE4）
【入手条件】主题数>=5
【商店售价】600金币
【等级1】3% 回帖金币+1▕▏升级条件：消耗300血液
【等级2】5% 回帖金币+1、发帖咒术+1▕▏升级条件：消耗600血液
【等级3】10% 回帖金币+2、发帖咒术+1▕▏升级条件：消耗600金币
【等级4】18% 回帖金币+3▕▏升级条件：金币≥444
【 Max 】12% 回帖金币+3、发帖咒术+1`,
'极客的晚宴': `极客的晚宴
【入手条件】无
【商店售价】100金币
【 Max 】2% 发帖知识+1`,
'雄躯的昇格': `雄躯的昇格
【入手条件】无
【商店售价】100金币
【 Max 】2% 发帖知识+1`,
'波纹蓝蛋': `波纹蓝蛋
【入手条件】旅程>=25
【商店售价】500金币
【等级1】1% 回帖知识+1
【等级2】2% 回帖知识+1、发帖知识+1▕▏升级条件：消耗400血液
【 Max 】4% 回帖知识+1、发帖知识+1▕▏升级条件：消耗800血液`,
'崩朽龙卵': `崩朽龙卵
【入手条件】主题数>=10
【商店售价】500金币
【等级1】3% 回帖咒术+1▕▏升级条件：消耗400血液
【等级2】5% 回帖咒术+1▕▏升级条件：消耗800血液
【 Max 】2% 回帖咒术+1、发帖灵魂+1`,
'冰海钓竿': `冰海钓竿
【入手条件】追随>=30
【商店售价】500金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗300金币
【等级2】8% 回帖金币+2▕▏升级条件：消耗600金币
【等级3】10% 回帖金币+3▕▏升级条件：消耗900金币
【 Max 】15% 回帖金币+3`,
'射手的火枪': `射手的火枪
【入手条件】咒术≥30
【商店售价】550金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗100金币
【等级2】7% 回帖金币+1▕▏升级条件：消耗200金币
【等级3】5% 回帖金币+2▕▏升级条件：消耗300金币
【等级4】10% 回帖金币+2▕▏升级条件：消耗650金币
【 Max 】12% 回帖金币+3`,
'米凯拉的锋刃': `米凯拉的锋刃
【入手条件】血液>=200
【商店售价】480金币
【等级1】5% 回帖堕落+1、发帖堕落+1▕▏升级条件：堕落≥50
【等级2】6% 回帖血液+1 堕落+1、发帖堕落+1▕▏升级条件：堕落≥100
【等级3】6% 回帖血液+2 堕落+1、发帖堕落+1▕▏升级条件：消耗222血液
【等级4】8% 回帖血液+3、发帖堕落+1▕▏升级条件：消耗血液444
【 Max 】10% 回帖血液+3 堕落+1、发帖血液+3 堕落+1`,
'朱迪·霍普斯': `朱迪·霍普斯
【入手条件】知识>=15
【商店售价】500金币
【等级1】5% 回帖金币+1、发帖血液+1▕▏升级条件：知识≥50
【等级2】7% 回帖金币+1、发帖血液+1▕▏升级条件：消耗550金币
【等级3】10% 回帖金币+2、发帖血液+2▕▏升级条件：消耗600血液
【 Max 】13% 回帖金币+2 血液+1、发帖旅程+1`,
'征服之王': `征服之王
【入手条件】2024年论坛活动【七日之屿】资源数排名前列
【商店售价】无
【 Max 】10% 回帖金币+1 血液-1`,
'岛屿探险家': `岛屿探险家
【入手条件】2024年论坛活动【七日之屿】全程参与
【商店售价】无
【 Max 】1% 回帖金币+1、发帖旅程+1`,
'列车长': `列车长
【入手条件】【极地特快】活动中，拼车成功的列车长奖励等级
【商店售价】无
【等级1】无属性▕▏升级条件：好友数≥6
【等级2】1% 回帖旅程+1 血液+1、发帖旅程+1 血液+1▕▏升级条件：消耗12旅程
【等级3】1% 回帖旅程+1 血液+1、发帖旅程+1 血液+1▕▏升级条件：获得12旅程
【 Max 】1% 回帖旅程+1 血液+1、发帖旅程+1 血液+1`,
'特供热巧': `特供热巧
【入手条件】【极地特快】活动中，拼车成功的车厢乘务员奖励
【商店售价】无
【等级1】1% 回帖血液+1、发帖血液+1▕▏升级条件：消耗1金币
【 Max 】1% 回帖血液+1、发帖血液+1`,
'六出冰花': `六出冰花
【入手条件】【雪中飞舞】发帖奖励、【极地特快】未拼车成功的列车长和车厢乘务员留念
【商店售价】无
【 Max 】1% 发帖旅程+1`,
'金色车票': `金色车票
【入手条件】2023年【极地特快】活动隐藏奖励，成功触发隐藏剧情：平安夜前发出“相信”的声音
【商店售价】无
【等级1】无属性▕▏升级条件：消耗1旅程
【等级2】无属性▕▏升级条件：得到1旅程
【等级3】无属性▕▏升级条件：灵魂≥1
【 Max 】无属性`,
'最终幻想XVI': `最终幻想XVI
【入手条件】无
【商店售价】100金币
【 Max 】1% 回帖旅程+1`,
'可疑的肉蛋': `可疑的肉蛋
【入手条件】堕落≥50
【商店售价】500金币
【等级1】3% 回帖堕落+1▕▏升级条件：消耗49咒术
【等级2】5% 回帖堕落+1▕▏升级条件：增加1知识
【等级3】7% 回帖堕落 +1 ▕▏升级条件：知识≥49
【等级4】10% 回帖堕落+1▕▏升级条件：消耗1灵魂
【 Max 】2% 回帖知识+1、发帖灵魂+1`,
'无垠': `无垠
【入手条件】无
【商店售价】2000金币
【等级1】1% 回帖血液+1、发帖血液+1▕▏升级条件:血液≥1
【等级2】1% 回帖旅程+1、发帖旅程+1▕▏升级条件:堕落≥800
【等级3】无属性▕▏升级条件:消耗1血液
【等级4】5% 回帖旅程+1、发帖旅程+1▕▏升级条件:堕落≥100
【等级5】4% 回帖旅程+1 血液+1、发帖旅程+1 血液+1▕▏升级条件:堕落≥200
【等级6】3% 回帖旅程+1 血液+1、发帖旅程+1 血液+1▕▏升级条件:堕落≥300
【等级7】3% 回帖旅程+1、发帖旅程+1▕▏升级条件:堕落≥400
【等级8】2% 回帖旅程+1 血液+1、发帖旅程+1 血液+1▕▏升级条件:堕落≥500
【等级9】4% 回帖旅程+1、发帖旅程+1▕▏升级条件:堕落≥600
【等级10】2% 回帖旅程+1、发帖旅程+1▕▏升级条件:堕落≥700
【 Max 】1% 回帖血液+1 旅程+1、发帖血液+1 旅程+1`,
'黑暗水晶': `黑暗水晶
【入手条件】堕落≥36
【商店售价】300金币
【等级1】6% 回帖堕落+1、发帖堕落+1▕▏升级条件：消耗200金币
【等级2】6% 回帖堕落+1 金币+1、发帖堕落+1 金币+1▕▏升级条件：消耗200血液
【等级3】12% 回帖堕落+1 金币+1、发帖堕落+1 金币+1▕▏升级条件：消耗66咒术
【等级4】12% 回帖堕落+2 金币+1、发帖堕落+2 金币+1▕▏升级条件：灵魂≥1
【等级5】18% 回帖金币+1、发帖金币+1`,
'棱镜': `棱镜
【入手条件】咒术≥20
【商店售价】666金币
【等级1】10% 回帖金币+2▕▏升级条件：堕落≥100
【 Max 】12% 回帖堕落-1`,
'天使之赐': `天使之赐
【入手条件】堕落≥30
【商店售价】288金币
【等级1】4% 回帖咒术+1、发帖咒术+1▕▏升级条件：消耗48咒术
【等级2】10% 回帖金币+2▕▏升级条件：消耗300金币
【 Max 】8% 回帖咒术+1、发帖咒术+1`,
'爱丽丝·盖恩斯巴勒': `爱丽丝·盖恩斯巴勒
【入手条件】知识≥30
【商店售价】400金币
【等级1】5% 回帖金币+1、发帖金币+1▕▏升级条件：消耗30咒术
【等级2】5% 发帖金币+2▕▏升级条件：消耗400血液
【等级3】8% 回帖金币+2、发帖金币+2▕▏升级条件：消耗66咒术
【等级4】14% 回帖血液+3▕▏升级条件：血液≥199（自动）
【等级5】9% 回帖金币+3、发帖金币+3▕▏升级条件：消耗1金币
【等级6】9% 回帖金币+3、发帖金币+3▕▏升级条件：消耗1金币`,
'凯特尼斯·伊夫狄恩': `凯特尼斯·伊夫狄恩
【入手条件】堕落≥10
【商店售价】450金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗150血液
【等级2】勋章博物馆资料暂缺
【等级3】28% 回帖血液-1 堕落+1▕▏升级条件：堕落≥444
【 Max 】18% 回帖金币+1`,
'克劳斯·迈克尔森': `克劳斯·迈克尔森
【入手条件】堕落≥5
【商店售价】516金币
【等级1】10% 回帖堕落+1▕▏升级条件：消耗111血液
【等级2】5% 回帖血液+1▕▏升级条件：消耗222血液
【等级3】8% 回帖血液+1▕▏升级条件：消耗333血液
【等级4】10% 回帖血液+2、发帖金币+1▕▏升级条件：金币≥920
【等级5】11% 回帖血液+2、发帖金币+2▕▏升级条件：血液≥920
【等级6】12% 回帖血液+2、发帖金币+3▕▏升级条件：消耗1灵魂
【 Max 】15% 回帖血液+3、发帖金币+5`,
'虎头怪': `虎头怪
【入手条件】旅程≥20
【商店售价】500金币
【等级1】8% 回帖血液+1、发帖旅程+1▕▏升级条件：追随≥50
【等级2】1% 回帖旅程+1、发帖旅程+1▕▏升级条件：消耗600血液
【等级3】2% 回帖旅程+1、发帖旅程+1▕▏升级条件：知识≥60
【等级4】3% 回帖旅程+1、发帖旅程+1▕▏升级条件：消耗1灵魂
【等级5】4% 回帖旅程+1、发帖旅程+1▕▏升级条件：在线时间≥2400
【 Max 】2% 回帖旅程+1、发帖灵魂+1`,
'重建熊屋': `重建熊屋
【入手条件】【丰饶山麓】重建村镇大厅的兑换奖品
【商店售价】无
【 Max 】2% 回帖金币+1`,
'图腾饼干': `图腾饼干
【入手条件】参与【丰饶山麓】救援重建熊人村的谢礼
【商店售价】无
【 Max 】1% 回帖血液+2`,
'龙之秘宝': `龙之秘宝
【入手条件】在【秋园庆丰】活动第一阶段的发帖中获得10追随
【商店售价】无
【等级1】无属性▕▏升级条件：消耗1血液
【等级2】2% 发帖堕落+1、回帖堕落+1▕▏升级条件：消耗1血液
【等级3】2% 发帖血液+1、回帖血液+1▕▏升级条件：消耗1血液
【等级4】2% 发帖金币+1、回帖金币+1▕▏升级条件：消耗1血液
【 Max 】2% 发帖咒术+1、回帖咒术+1`,
'长花的蛋': `长花的蛋
【入手条件】知识≥10
【商店售价】366金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗72咒术
【等级2】10% 回帖金币+1▕▏升级条件：咒术≥36
【 Max 】15% 回帖金币+2`,
'棕色条纹蛋': `棕色条纹蛋
【入手条件】追随≥35
【商店售价】520金币
【等级1】1% 回帖咒术+1▕▏升级条件：消耗80血液
【等级2】3% 回帖咒术+1▕▏升级条件：消耗150血液
【等级3】5% 回帖咒术+1▕▏升级获得1旅程
【等级4】8% 回帖咒术+1▕▏升级条件：消耗150金币
【等级5】3% 回帖知识+1▕▏升级条件：在线时间≥1999
【 Max 】1% 回帖知识+1、发帖灵魂+1`,
'被尘封之书': `被尘封之书
【入手条件】堕落≥99
【商店售价】999金币
【等级1】3% 回帖血液+2▕▏升级条件：消耗1000血液
【等级2】6% 回帖血液+2▕▏升级条件：消耗1000血液
【等级4】12% 回帖血液+2▕▏升级条件：堕落≥200
【等级5】15% 回帖血液+2▕▏升级条件：堕落≥300
【等级6】18% 回帖血液+2▕▏升级条件：堕落≥400
【等级7】21% 回帖血液+2▕▏升级条件：堕落≥500
【等级8】24% 回帖血液+2▕▏升级条件：堕落≥600
【等级9】27% 回帖血液+2▕▏升级条件：堕落≥700
【等级10】30% 回帖血液+2▕▏升级条件：堕落≥800
【等级11】35% 回帖血液+2▕▏升级条件：消耗1灵魂
【 Max 】50% 回帖血液+2`,
'和谐圣杯': `和谐圣杯
【入手条件】知识≥15
【商店售价】300金币
【等级1】5% 回帖堕落-1、发帖堕落-2▕▏升级条件：消耗88咒术
【等级2】10% 回帖堕落-2、发帖堕落-3▕▏升级条件：消耗400血液
【 Max 】10% 回帖血液+2 堕落+1、发帖血液+3 堕落+3`,
'双项圣杯': `双项圣杯
【入手条件】咒术＞=20
【商店售价】100金币
【等级1】无属性▕▏升级条件：消耗1金币
【等级2】2% 回帖血液+1、发帖血液+1▕▏升级条件：消耗1金币
【等级3】1% 回帖咒术+1、发帖咒术+1▕▏升级条件：消耗10金币
【等级4】2% 回帖血液+2、发帖血液+2▕▏升级条件：消耗10金币
【等级5】8% 回帖血液+1、发帖血液+1▕▏升级条件：消耗1000金币
【 Max 】8% 回帖血液+2 咒术+2、发帖血液+2 咒术+2`,
'露娜弗蕾亚·诺克斯·芙尔雷': `露娜弗蕾亚·诺克斯·芙尔雷
【入手条件】知识≥20
【商店售价】500金币
【等级1】4% 回帖咒术+1、发帖血液+1▕▏升级条件：消耗150金币
【等级2】6% 回帖血液+1、发帖血液+2▕▏升级条件：消耗200金币
【等级3】8% 回帖血液+1、发帖血液+2▕▏升级条件：消耗300金币
【等级4】10% 回帖血液+2、发帖血液+3▕▏升级条件：消耗120咒术
【 Max 】13% 回帖血液+3、发帖血液+5`,
'凯尔': `凯尔
【入手条件】主题数>=10
【商店售价】300金币
【等级1】8% 回帖血液+1、发帖旅程+1▕▏升级条件：灵魂≥1
【等级2】15% 回帖血液+1、发帖旅程+2▕▏升级条件：消耗300金币
【等级3】15% 回帖血液+2、发帖旅程+1▕▏升级条件：堕落≥10
【 Max 】12% 回帖血液+2、发帖旅程+1`,
'莫甘娜': `莫甘娜
【入手条件】主题数>=10
【商店售价】300金币
【等级1】8% 回帖金币+1、发帖旅程+1▕▏升级条件：灵魂≥1
【等级2】10% 回帖金币+1、发帖旅程+1▕▏升级条件：消耗300血液
【等级3】15% 回帖金币+2、发帖旅程+1▕▏升级条件：堕落≥10
【 Max 】12% 回帖金币+2、发帖旅程+1`,
'阿尔瓦罗·索莱尔': `阿尔瓦罗·索莱尔
【入手条件】追随≥10
【商店售价】500金币
【等级1】6% 回帖金币+1▕▏升级条件：消耗50金币
【等级2】勋章博物馆资料暂缺
【等级3】6% 回帖金币+3▕▏升级条件：追随≥150
【等级4】8% 回帖金币+3▕▏升级条件：消耗150金币
【 Max 】12% 回帖金币+2、发帖金币+3`,
'纣王·子受': `纣王·子受
【入手条件】无
【商店售价】500金币
【等级1】5% 回帖金币+1、发帖金币+2▕▏升级条件：消耗400金币
【等级2】10% 回帖金币+1、发帖金币+2▕▏升级条件：消耗400血液
【等级3】10% 回帖金币+1 堕落+1、发帖金币+3▕▏升级条件：消耗100咒术
【等级4】15% 回帖金币+1 堕落-1、发帖旅程+1▕▏升级条件：消耗1灵魂
【等级5】20% 回帖金币+2、发帖旅程+1▕▏升级条件：堕落≥100
【 Max 】3% 回帖旅程+1、发帖旅程+1`,
'阿齐斯': `阿齐斯
【入手条件】堕落≥60
【商店售价】480金币
【等级1】8% 回帖血液+1、发帖血液+2▕▏升级条件：消耗300金币
【等级2】10% 回帖血液+2 金币-1、发帖堕落+1▕▏升级条件：消耗600金币
【等级3】12% 回帖血液+3 金币-1▕▏升级条件：消耗900金币
【 Max 】18% 回帖血液+3、发帖堕落+1`,
'百相千面': `百相千面
【入手条件】发帖数≥100
【商店售价】1000金币
【等级1】5% 回帖金币+1 血液+1、发帖旅程+1▕▏升级条件：消耗100金币
【等级2】5% 回帖金币+1 血液+1、发帖旅程+1▕▏升级条件：消耗1000血液
【等级3】5% 回帖金币+2 血液+2、发帖金币+3 血液+3▕▏升级条件：消耗1000金币
【 Max 】5% 回帖旅程+1、发帖金币+3 血液+3`,
'肉垫手套': `肉垫手套
【入手条件】参与【河谷寻奇】活动，用70枚游戏金币兑换
【商店售价】无
【 Max 】2% 回帖金币+1、发帖金币+1`,
'绿茵宝钻': `绿茵宝钻
【入手条件】参与【河谷寻奇】活动，获得的游戏金币数量排名前10%
【商店售价】无
【 Max 】1% 回帖金币+6、发帖金币+6`,
'猛虎贴贴': `猛虎贴贴
【入手条件】参与【巧夕之月】，发布的帖子在各板块中追随数排名前五，或者在活动贴留言抽奖中奖
【商店售价】无
【等级1】1% 回帖血液+1▕▏升级条件：消耗1血液
【等级2】3% 回帖血液+1▕▏升级条件：消耗1血液
【 Max 】5% 回帖血液+1`,
'白巧克力蛋': `白巧克力蛋
【入手条件】参与【巧夕之月】，发布符合活动主题条件的帖子LV1
【商店售价】无
【等级1】1% 回帖金币+1▕▏升级条件：1金币
【 Max 】3% 回帖金币+1`,
'灵藤蛋': `灵藤蛋
【入手条件】知识≥5
【商店售价】350金币
【等级1】5% 回帖血液+1▕▏升级条件：知识≥30
【 Max 】3% 回帖知识+1`,
'令人不安的契约书': `令人不安的契约书
【入手条件】咒术≥5
【商店售价】200金币
【等级1】1% 回帖咒术+1▕▏升级条件：消耗15咒术
【等级2】2% 回帖咒术+1▕▏升级条件：获得20金币
【 Max 】3% 回帖咒术+1 金币+1`,
'星籁歌姬': `星籁歌姬
【入手条件】追随≥10
【商店售价】500金币
【等级1】3% 回帖血液+1▕▏升级条件：消耗30咒术
【等级2】6% 回帖血液+1、发帖血液+1▕▏升级条件：消耗270金币
【等级3】9% 回帖血液+1、发帖血液+2▕▏升级条件：追随≥100
【等级4】12% 回帖血液+2、发帖血液+3▕▏升级条件：追随≥200
【 Max 】15% 回帖血液+2、发帖知识+1 血液-3`,
'维涅斯': `维涅斯
【入手条件】旅程≥14
【商店售价】700金币
【等级1】4% 回帖咒术+1、发帖知识+1▕▏升级条件：主题数≥14
【等级2】6% 回帖咒术+1、发帖知识+1▕▏升级条件：消耗140金币
【等级3】8% 回帖咒术+1、发帖知识+1▕▏升级条件：知识≥140
【等级4】3% 回帖旅程+1、发帖知识+1▕▏升级条件：消耗1144血液
【 Max 】2% 回帖知识+1、发帖灵魂+1`,
'刀锋女王': `刀锋女王
【入手条件】咒术≥50
【商店售价】600金币
【等级1】3% 回帖咒术+1、发帖咒术+1▕▏升级条件：咒术≥120
【等级2】6% 回帖咒术+1、发帖咒术+1▕▏升级条件：消耗60咒术
【等级3】9% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗200金币
【等级4】12% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗200血液
【等级5】15% 回帖血液+2、发帖旅程+1▕▏升级条件：消耗350血液
【 Max 】15% 回帖血液+3、发帖旅程+1`,
'天照大神': `天照大神
【入手条件】追随≥13
【商店售价】500金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗130血液
【等级2】7% 回帖金币+1、发帖知识+1▕▏升级条件：血液≥1300
【等级3】9% 回帖金币+1、发帖知识+1▕▏升级条件：消耗130血液
【等级4】12% 回帖金币+2、发帖知识+1▕▏升级条件：消耗1300血液
【 Max 】12% 回帖咒术+1、发帖知识+1`,
'桑克瑞德·沃特斯': `桑克瑞德·沃特斯
【入手条件】旅程≥21
【商店售价】520金币
【等级1】1% 回帖血液+7▕▏升级条件：消耗52血液
【等级2】1% 回帖血液+8▕▏升级条件：堕落≥52
【等级3】2% 回帖血液+8▕▏升级条件：消耗52咒术
【等级4】2% 回帖血液+9▕▏升级条件：咒术≥180
【 Max 】3% 回帖血液+9`,
'星河碎片': `星河碎片
【入手条件】灵魂≥1且主题数≥1且知识≥7且旅程≥7
【商店售价】1知识
【等级1】无属性▕▏升级获得1知识
【 Max 】无属性`,
'探险三杰士': `探险三杰士
【入手条件】扮演战士、游侠、法师三大职业，参与【迷翳森林】探险活动
【商店售价】无
【等级1】1% 回帖血液+2`,
'『迷翳森林回忆录』': `『迷翳森林回忆录』
【入手条件】在『迷翳森林』探险活动中，收集15枚迷翳结晶兑换获得
【商店售价】无
【等级1】2% 回帖金币+2、发帖旅程+1`,
'『迷翳之中』': `『迷翳之中』
【入手条件】灵魂≥1并且旅程≥10并且主题数≥1
【商店售价】10旅程
【等级1】无属性▕▏升级条件：获得2旅程
【等级2】无属性▕▏升级条件：获得3旅程
【等级3】无属性▕▏升级条件：获得5旅程
【等级4】无属性▕▏升级条件：旅程≥50
【等级5】无属性▕▏升级条件：消耗1知识
【 Max 】无属性`,
'『灰域来音』': `『灰域来音』
【入手条件】灵魂≥1
【商店售价】10旅程
【等级1】无属性▕▏升级条件：-10旅程
【 Max 】无属性`,
'狱炎蛋': `狱炎蛋
【入手条件】堕落≥66
【商店售价】266血液
【等级1】4% 回帖血液+1 堕落+1、发帖血液+1 堕落+1▕▏升级条件：堕落维持100
【 Max 】7% 回帖血液+1 堕落+1、发帖血液+1 堕落+1`,
'散佚的文集': `散佚的文集
【入手条件】知识≥10
【商店售价】250金币
【等级1】2% 回帖知识+1、发帖知识+1▕▏升级条件：知识≥25
【等级2】5% 回帖血液+2 堕落-1、发帖血液+2 堕落-1▕▏升级条件：消耗200血液
【等级3】6% 回帖血液+3 堕落-1、发帖血液+3 堕落-1▕▏升级条件：消耗300血液
【 Max 】7% 回帖咒术+1 堕落-1、发帖咒术+1 堕落-1`,
'女神之泪': `女神之泪
【入手条件】咒术≥36
【商店售价】500金币
【等级1】5% 回帖血液+1、发帖血液+3▕▏升级条件：消耗360血液
【等级2】10% 回帖血液+2、发帖血液+3▕▏升级条件：咒术≥360
【 Max 】10% 回帖血液+3、发帖血液+5`,
'希尔瓦娜斯·风行者': `希尔瓦娜斯·风行者
【入手条件】知识≥30
【商店售价】500金币
【等级1】3% 回帖血液+2、发帖金币+3▕▏升级条件：追随≥50
【等级2】6% 回帖血液+2、发帖金币+3▕▏升级条件：在线时间≥666
【等级3】9% 回帖血液+2、发帖金币+3▕▏升级条件：消耗500金币
【等级4】12% 回帖血液+2、发帖金币+3▕▏升级条件：消耗666血液
【 Max 】15% 回帖血液+3、发帖金币+3`,
'死亡': `死亡
【入手条件】追随≥10
【商店售价】444金币
【等级1】13% 回帖金币-1▕▏升级条件：130血液
【等级3】13% 回帖血液+1 金币-1▕▏升级条件：≥80知识
【等级3】13% 回帖血液+1 金币+1、发帖旅程+1▕▏升级条件：1300血液
【等级4】2% 回帖旅程+1、发帖灵魂+1▕▏升级条件：≥2灵魂
【 Max 】15% 回帖金币+3、发帖旅程+1`,
'弗图博士': `弗图博士
【入手条件】无
【商店售价】1024金币
【等级1】10% 回帖金币+1 血液+1▕▏升级条件：≥40旅程
【等级2】10% 回帖金币+1 血液+1、发帖知识+1▕▏升级条件：≥40堕落
【等级3】10% 回帖金币+2 血液+1、发帖知识+1▕▏升级条件：≥40咒术
【 Max 】2% 回帖知识+1 血液+1、发帖灵魂+1`,
'不屈之枪·阿特瑞斯': `不屈之枪·阿特瑞斯
【入手条件】堕落≤450
【商店售价】450金币
【等级1】3% 回帖旅程+1▕▏自动升级条件：旅程≥88
【等级2】1% 发帖灵魂+1▕▏自动升级条件：灵魂≥1
【 Max 】8% 回帖血液+2、发帖旅程+1`,
'【周年限定】克里斯(8)': `【周年限定】克里斯(8)
【入手条件】主题数≥5
【商店售价】600金币
【等级1】10% 回帖金币+1▕▏升级条件：消耗200金币
【等级2】20% 回帖金币+1▕▏升级条件：消耗200血液
【等级3】30% 回帖金币+1▕▏升级条件：消耗1灵魂
【 Max 】50% 回帖金币+1`,
'破旧打火机': `破旧打火机
【入手条件】无
【商店售价】25金币
【等级1】无属性▕▏升级条件：消耗1金币
【等级2】无属性▕▏升级条件：消耗1血液
【等级3】无属性▕▏升级条件：消耗1咒术
【等级4】无属性▕▏升级条件：消耗1知识
【等级5】无属性▕▏升级条件：消耗1旅程
【等级6】5% 回帖金币+1▕▏升级条件：灵魂≥1
【 Max 】15% 回帖金币+1`,
'山村贞子': `山村贞子
【入手条件】咒术≥44
【商店售价】300金币
【等级1】10% 回帖血液+1、发帖咒术+1▕▏升级条件：消耗250血液
【等级2】15% 回帖血液+1、发帖咒术+1▕▏升级条件：消耗500血液
【 Max 】15% 回帖血液+2、发帖咒术+2`,
'蒂法·洛克哈特': `蒂法·洛克哈特
【入手条件】堕落≥30
【商店售价】400金币
【等级1】1% 回帖旅程+1、发帖旅程+1▕▏消耗100血液
【等级2】2% 回帖旅程+1、发帖旅程+1▕▏消耗200血液
【等级3】3% 回帖旅程+1、发帖旅程+1▕▏消耗300血液
【 Max 】4% 回帖旅程+1、发帖旅程+1`,
'九尾妖狐·阿狸': `九尾妖狐·阿狸
【入手条件】血液≥350
【商店售价】350金币
【等级2】8% 回帖血液+2、发帖咒术+1▕▏升级条件：消耗89咒术
【 Max 】13% 回帖血液+2、发帖咒术+2`,
'勒维恩·戴维斯': `勒维恩·戴维斯
【入手条件】无
【商店售价】400金币
【等级1】10% 无属性▕▏升级条件：消耗1金币
【等级2】10% 回帖金币+2、发帖金币+2▕▏升级条件：消耗1金币
【等级3】10% 回帖金币+2、发帖金币+2▕▏升级条件：消耗1金币
【等级4】10% 回帖金币+2、发帖金币+2▕▏升级条件：消耗1金币
【等级5】10% 回帖金币+2、发帖金币+2▕▏升级条件：消耗1金币
【等级6】10% 回帖金币+2、发帖金币+2▕▏升级条件：消耗1金币
【等级7】10% 回帖金币+2、发帖金币+2▕▏＜85金币触发
【等级8】10% 回帖金币+2、发帖金币+2▕▏≥85金币且＜233金币触发
【 Max 】10% 回帖金币+2、发帖金币+2▕▏≥233金币触发`,
'擎天柱（Peterbilt389）': `擎天柱（Peterbilt389）
【入手条件】追随≥20
【商店售价】400金币
【等级1】4% 回帖血液+1、发帖咒术+1▕▏升级条件：消耗233血液
【等级2】5% 回帖咒术+1 血液+1、发帖咒术+1▕▏升级条件：消耗233金币
【等级3】6% 回帖咒术+1 血液+1、发帖咒术+1▕▏升级条件：消耗66咒术
【等级4】7% 回帖咒术+1 血液+2、发帖旅程+1▕▏自动升级条件：旅程≥80
【 Max 】8% 回帖咒术+1 血液+3、发帖旅程+1`,
'丹·雷诺斯': `丹·雷诺斯
【入手条件】主题数≥5
【商店售价】400金币
【等级1】4% 回帖堕落-1▕▏升级条件：消耗100金币
【等级2】6% 回帖堕落-1▕▏升级条件：消耗200金币
【等级3】8% 回帖堕落-1▕▏升级条件：消耗40咒术
【等级4】11% 回帖堕落-1 血液+2▕▏升级条件：消耗80咒术
【等级5】13% 回帖堕落-1 血液+2、发帖血液+2▕▏升级条件：≥250追随
【等级6】15% 回帖堕落-1 血液+2、发帖堕落-1 血液+2▕▏升级条件：消耗1金币（切换卡面）
【 Max 】15% 回帖堕落-1 血液+2、发帖堕落-1 血液+2`,
'尼克·王尔德': `尼克·王尔德
【入手条件】堕落≥30
【商店售价】500金币
【等级1】5% 回帖血液+1、发帖金币+1▕▏升级条件：知识≥50
【等级2】7% 回帖血液+1、发帖金币+1▕▏升级条件：消耗550血液
【等级3】10% 回帖血液+2、发帖金币+2▕▏升级条件：消耗600金币
【 Max 】13% 回帖血液+2 金币+1、发帖金币+1`,
'謎の男': `謎の男
【入手条件】募捐活动奖励，凡募捐一次即可获得。
【商店售价】无
【等级1】100% 回帖血液+1、发帖金币+1`,
'Chris Redfield in Uroboros': `Chris Redfield in Uroboros
【入手条件】"重口味学习小组"群组勋章，由群主颁发。
【商店售价】无
【 Max 】1% 回帖知识+1、发帖知识+1`,
'杀意人偶': `杀意人偶
【入手条件】在线时间(小时)≥72
【商店售价】8咒术
【持续时间】7天
【等级1】1% 回帖血液+1▕▏升级条件：2咒术
【等级2】10% 回帖血液+2▕▏升级条件：旅程≥59
【等级3】11% 回帖血液+3▕▏升级条件：旅程≥219
【 Max 】8% 回帖堕落+1 金币-1`,
'雷霆晶球': `雷霆晶球
【入手条件】咒术≥14
【商店售价】7咒术
【持续时间】7天
【等级1】无属性▕▏升级条件：7咒术
【等级2】7% 回帖血液+1 咒术+1、发帖血液+1 咒术+1▕▏升级条件：-7咒术（不要忘了拿！）
【 Max 】无属性`,
'思绪骤聚': `思绪骤聚
【入手条件】咒术≥20&知识≥10
【商店售价】15咒术
【持续时间】5天
【等级1】3% 回帖知识+1、发帖知识+1▕▏升级条件：-1知识（不要忘了拿！）
【等级2】无属性▕▏升级条件：知识≥500
【 Max 】无属性`,
'闪光糖果盒': `闪光糖果盒
【入手条件】无
【商店售价】70金币
【等级Max】17% 发帖咒术+1 血液+3`,
'茉香啤酒': `茉香啤酒
【入手条件】无
【商店售价】25金币
【等级1】无属性▕▏升级获得1血液
【 Max 】15% 回帖血液+1 堕落-1、发帖血液-1 堕落+1`,
'艾利克斯': `艾利克斯
【入手条件】堕落≥50
【商店售价】600金币
【等级1】4% 回帖血液+1 堕落+1▕▏升级条件：消耗150金币
【等级2】6% 回帖血液+2 堕落+1▕▏升级条件：堕落≥120
【等级3】8% 回帖血液+2 堕落+1▕▏升级条件：消耗150金币
【等级4】10% 回帖血液+2 堕落+1▕▏升级条件：送1旅程
【等级4】11% 回帖血液+2 堕落+1▕▏升级条件：消耗666血液
【 Max 】12% 回帖血液+3 堕落+1`,
'巴比伦辞典': `巴比伦辞典
【入手条件】单机游戏区发帖激励长期活动，对精翻汉化和自制游戏作者的答谢。
【商店售价】不可购买
【 Max 】50% 回帖金币+1、发帖金币+1`,
'金翼使': `金翼使
【入手条件】在单机游戏区当月发布主题获得2次 [优秀] 或1次 [精华]
【商店售价】不可购买
【 Max 】20% 回帖金币+1 血液+1`,
'巨力橡果': `巨力橡果
【入手条件】在动漫分享区（含和谐动漫）累计发表5次的精翻汉化主题
【商店售价】不可购买
【 Max 】20% 回帖金币+1 血液+1`,
'照相机': `照相机
【入手条件】【瞬时映景】活动奖励
【商店售价】无
【 Max 】2% 回帖血液+1`,
'约书亚・罗兹菲尔德': `约书亚・罗兹菲尔德
【入手条件】堕落>=160
【商店售价】500金币
【等级1】1% 回帖血液+1▕▏升级条件：消耗1600金币
【等级2】2% 回帖血液+1、发帖灵魂+1 堕落+3▕▏升级条件：16堕落
【等级3】10% 回帖血液+3、发帖血液+3 堕落+1▕▏升级条件：32堕落
【等级4】8% 回帖血液+2、发帖血液+2▕▏升级条件：80堕落
【等级5】6% 回帖堕落-1、发帖堕落-1▕▏升级条件：160堕落
【等级5】8% 回帖堕落-1、发帖堕落-1▕▏升级条件：250堕落
【 Max 】10% 回帖堕落-2、发帖堕落-2▕▏升级条件：160堕落`,
'阿怪': `阿怪
【入手条件】【夜影迷踪】活动参与奖
【商店售价】无
【 Max 】2% 发帖血液+1`,
'克莱夫・罗兹菲尔德': `克莱夫・罗兹菲尔德
【入手条件】主题数>=16
【商店售价】622金币
【等级1】3% 回帖金币+1▕▏升级条件：消耗320金币
【等级2】5% 回帖金币+1▕▏升级条件：消耗480血液
【等级3】7% 回帖金币+2、发帖咒术+1▕▏升级条件：消耗640血液
【等级4】9% 回帖金币+2、发帖咒术+1▕▏升级条件：消耗640血液
【等级5】13% 回帖金币+2、发帖咒术+1▕▏升级条件：消耗1灵魂
【 Max 】16% 回帖金币+2 血液+1、发帖咒术+1`,
'吉尔·沃瑞克': `吉尔·沃瑞克
【入手条件】知识>=16
【商店售价】460金币
【等级1】无属性▕▏升级条件： 消耗80金币
【等级2】6% 回帖金币+2、发帖血液+1▕▏升级条件：消耗80血液
【等级3】5% 回帖金币+3、发帖血液+2▕▏升级条件：消耗160血液
【等级4】4% 回帖金币+4、发帖血液+3▕▏升级条件：消耗320血液
【 Max 】8% 回帖金币+3、发帖血液+2`,
'太空列车票': `太空列车票
【入手条件】知识>=10
【商店售价】5咒术
【等级1】1% 回帖血液+1▕▏升级条件：旅程≥30
【等级2】5% 回帖血液+1▕▏升级条件：旅程≥50
【等级3】7% 回帖血液+1 金币+1▕▏升级条件：知识≥40
【等级4】12% 回帖血液+1 金币+1▕▏升级条件：消耗30金币
【 Max 】1% 回帖旅程+1`,
'希德法斯·特拉蒙': `希德法斯·特拉蒙
【入手条件】旅程>=16
【商店售价】720金币
【等级1】无属性▕▏升级条件：消耗48咒术
【等级2】3% 回帖咒术+1 血液+1、发帖咒术+1▕▏升级条件：消耗160血液
【等级3】5% 回帖咒术+1 血液+1、发帖咒术+1▕▏升级条件：消耗320血液
【 Max 】8% 回帖咒术+1 血液+2、发帖咒术+1`,
'神秘挑战书': `神秘挑战书
【入手条件】旅程>=28
【商店售价】348金币
【等级1】8% 回帖血液+1▕▏升级条件：消耗2旅程
【等级2】8% 回帖血液+1▕▏升级条件：消耗2旅程
【等级3】8% 回帖血液+1▕▏升级条件：消耗2旅程
【等级4】8% 回帖血液+1▕▏升级条件：消耗2旅程
【等级5】8% 回帖血液+1▕▏升级条件：获得2旅程
【等级6】8% 回帖血液+1▕▏升级条件：获得2旅程
【等级7】8% 回帖血液+1▕▏升级条件：获得2旅程
【等级8】8% 回帖血液+1▕▏升级条件：获得2旅程
【等级9】8% 回帖血液+1▕▏升级条件：在线时间≥2888
【 Max 】1% 回帖血液+8、发帖血液+8`,
'坏掉的月亮提灯': `坏掉的月亮提灯
【入手条件】无
【商店售价】380金币
【等级1】4% 回帖咒术+1 血液+1、发帖咒术+1▕▏升级条件：咒术≥100
【 Max 】6% 回帖咒术+1 血液+1、发帖咒术+2`,
'吸血猫蛋': `吸血猫蛋
【入手条件】无
【商店售价】333金币
【等级1】5% 回帖血液+1▕▏升级条件：消耗66血液
【等级2】6% 回帖血液+2、发帖血液+1▕▏升级条件：消耗666血液
【等级3】7% 回帖血液+2、发帖血液+2▕▏升级条件：咒术≥123
【 Max 】8% 回帖血液+2 咒术+1、发帖咒术+3`,
'装了衣物的纸盒': `装了衣物的纸盒
【入手条件】无
【商店售价】99金币
【等级1】无属性▕▏升级条件：消耗69血液
【等级2】6% 回帖堕落+1、发帖堕落+1▕▏升级条件：旅程≥69
【 Max 】10% 回帖血液-1 堕落+1、发帖血液-1 堕落+1`,
'狄翁・勒萨若': `狄翁・勒萨若
【入手条件】在线时间（小时）>=160
【商店售价】480金币
【等级1】无属性▕▏升级条件：消耗160金币
【等级2】2% 回帖血液+1 发帖血液+1▕▏升级条件：消耗160金币
【等级3】4% 回帖血液+1 发帖咒术+1▕▏升级条件：消耗320血液
【等级4】6% 回帖血液+2 发帖咒术+1▕▏升级条件：消耗48咒术
【等级5】8% 回帖血液+2 金币+1、发帖咒术+2 金币+3▕▏升级条件：消耗64咒术
【 Max 】10% 回帖血液+2 金币+2、发帖知识+1 金币+3`,
'五谷丰年': `五谷丰年
【入手条件】在线时间>=120小时，注册天数>=24，旅程>=24
【商店售价】无
【等级1】4% 回帖血液+2 金币-1、发帖血液+4▕▏升级条件：血液≥365
【等级2】5% 回帖血液+2 金币-1、发帖血液+4▕▏升级条件：知识≥365
【等级3】12% 回帖血液+2 金币-1、发帖血液+4▕▏升级条件：旅程≥365
【 Max 】24% 回帖金币+1、发帖金币+1`,
'库伦 (审判)': `库伦 (审判)
【入手条件】无
【商店售价】450金币
【等级1】5% 回帖血液+1▕▏升级条件：知识≥16
【等级2】7% 回帖血液+1、发帖血液+1▕▏升级条件：消耗350血液
【等级3】15% 回帖血液+2、发帖血液+2▕▏升级条件：血液≥200
【 Max 】10% 回帖血液+1、发帖血液+1 金币+1 旅程+1`,
'库伦 (起源)': `库伦 (起源)
【入手条件】咒术≤25
【商店售价】480金币
【等级1】18% 回帖血液+2、发帖血液+6▕▏升级条件：咒术≥11
【 Max 】7% 发帖血液+6 咒术-1`,
'变身器': `变身器
【入手条件】【细语欢歌】活动期间根据抽取到的主题在音乐区发布翻唱歌曲
【商店售价】无
【等级1】2% 回帖咒术+1、发帖咒术+1▕▏升级条件：咒术≥1000
【 Max 】2% 回帖咒术+1、发帖咒术+1`,
'GM村蛋糕': `GM村蛋糕
【入手条件】达到LV2的坛友于生日当天在兔兔的生日蛋糕登记处登记
【商店售价】无
【 Max 】30% 回帖金币+1、血液+1`,
'近地夜航': `近地夜航
【入手条件】在【十一周年】活动期间于论坛任意符合规定的版块发表主题帖，符合活动规定即可免费获得
【商店售价】无
【 Max 】11% 发帖知识+1`,
'半生黄金种': `半生黄金种
【入手条件】无
【商店售价】120金币
【等级1】2% 回帖金币+1、发帖金币+1▕▏升级条件：消耗1知识
【等级2】2% 回帖咒术+1、发帖咒术+1▕▏升级条件：堕落≥22
【等级3】20% 回帖金币+2 堕落+1、发帖金币+3▕▏升级条件：堕落≥23
【等级4】3% 回帖咒术+1、发帖咒术+1▕▏升级条件：堕落≥123
【 Max 】12% 回帖金币+1、发帖金币+1`,
'Zootopia': `Zootopia
【入手条件】旅程 >= 15
【商店售价】100金币
【等级1】3% 回帖咒术+1▕▏升级条件：消耗1旅程
【等级2】3% 回帖咒术+1▕▏升级条件：消耗1旅程
【等级3】3% 回帖咒术+1▕▏升级条件：消耗1旅程
【等级4】3% 回帖咒术+1▕▏升级条件：消耗1旅程
【等级5】3% 回帖咒术+1▕▏升级条件：获得1旅程
【 Max 】3% 回帖咒术+1`,
'肃弓': `肃弓
【入手条件】无
【商店售价】299金币
【等级1】3% 回帖金币+1 堕落-1▕▏升级条件：消耗188血液
【等级2】5% 回帖金币+1 堕落-1▕▏升级条件：消耗66咒术
【 Max 】10% 回帖金币+1 血液-1 堕落-1`,
'叶卡捷琳娜': `叶卡捷琳娜
【入手条件】主题数>=3
【商店售价】480金币
【等级1】5% 回帖金币+1▕▏升级条件：消耗200金币
【等级2】8% 回帖咒术+1▕▏升级条件：消耗350血液
【等级3】8% 回帖金币+1 血液+1、发帖金币+1 血液+1 金币+2▕▏升级条件：消耗66咒术
【 Max 】12% 回帖金币+2 血液+1、发帖血液+1`,
'莱昂纳多·迪卡普里奥': `莱昂纳多·迪卡普里奥
【入手条件】知识 >= 10
【商店售价】666金币
【等级1】8% 回帖金币+1、发帖金币+2▕▏升级条件：金币≥666
【等级2】18% 回帖金币+3、发帖金币+3  升级条件：金币≥688
【等级3】12% 回帖金币+2、发帖金币+2▕▏升级条件：消耗1灵魂
【 Max 】15% 回帖金币+3、发帖旅程+1`,
'迷之瓶': `一共两个同名徽章，一个资产类asset，一个是活动奖励类prize
迷之瓶【资产类】
【入手条件】注册天数>=1700（天）, 堕落>=20, 旅程>=38,知识>=4
【商店售价】120金币
【 Max 】5% 回帖堕落+1、发帖金币+1 堕落+1

迷之瓶【活动奖励类】
【入手条件】同时拥有[充满魔力的种子]、[木柴堆]、[暗红矿土]之后向作者（敏感先生）换取。
【商店售价】无
【等级1】7% 回帖 金币+3 血液+1 咒术+1▕▏升级条件：消耗1灵魂
【 Max 】10% 回帖 金币+3 血液+1 咒术+1、发帖金币+5 血液+2 咒术+2`,
'布莱恩‧欧康纳': `布莱恩‧欧康纳
【入手条件】追随≥20
【商店售价】400金币
【等级1】4% 回帖金币+1▕▏升级条件：消耗100金币
【等级2】6% 回帖金币+1▕▏升级条件：消耗100血液
【等级3】8% 回帖金币+1▕▏升级条件：追随≥101
【 Max 】10% 回帖金币+2、发帖旅程+1`,
'老旧的怀表': `老旧的怀表
【入手条件】在线时间>=280
【商店售价】280金币
【等级1】5% 回帖血液+1、发帖知识+1▕▏升级条件：消耗120金币
【等级2】10% 回帖血液+1、发帖知识+1▕▏升级条件：消耗200血液
【 Max 】2% 回帖知识+1、发帖灵魂+1`,
'“米凯拉的锋刃”玛莲妮亚': `“米凯拉的锋刃”玛莲妮亚
【入手条件】血液>=200
【商店售价】480金币
【等级1】5% 回帖堕落+1、发帖堕落+1▕▏升级条件：堕落≥50
【等级2】6% 回帖血液+1 堕落+1、发帖堕落+1▕▏升级条件：堕落≥100
【等级3】6% 回帖血液+2 堕落+1、发帖堕落+1▕▏升级条件：消耗222血液
【等级4】8% 回帖血液+3、发帖堕落+1▕▏升级条件：消耗444血液
【等级5】10% 回帖堕落-1▕▏升级条件：消耗111咒术
【 Max 】10% 回帖血液+3 堕落+1、发帖血液+3 堕落+1`,
'辐射：新维加斯': `辐射：新维加斯
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖 堕落+1`,
'超级无敌名贵金卡': `超级无敌名贵金卡
【入手条件】无
【商店售价】688金币
【 Max 】100% 回帖金币+0`,
'上古卷轴V：天际': `上古卷轴V：天际
【入手条件】无
【商店售价】100金币
【 Max 】2% 回帖金币+2`,
'『居住证: Lv2~6』': `『居住证: Lv2~6』
【入手条件】用户等级2-6
【商店售价】无
【 Max 】1% 回帖旅程+1、发帖旅程+1，`,
'里昂‧S‧甘乃迪': `里昂‧S‧甘乃迪
【入手条件】无
【商店售价】450金币
【等级1】8% 回帖金币+1、发帖金币+1▕▏升级条件：金币≥100（猜测）
【等级2】10% 回帖金币+1、发帖金币+1▕▏升级条件：血液≥180血液
【等级3】10% 回帖金币+1 血液+1、发帖金币+1 血液+1▕▏升级条件：消耗300金币
【等级4】12% 回帖金币+2 血液+1、发帖金币+2 血液+1▕▏升级条件：血液≥300
【 Max 】16% 回帖血液+3、发帖血液+3`,
'维克多‧天火': `维克多‧天火
【入手条件】堕落≤50
【商店售价】460金币
【等级1】3% 回帖金币-1 血液+2 ▕▏升级条件：需求150血液
【等级2】3% 回帖金币+1、发帖血液+2▕▏升级条件：消耗55堕落
【等级3】10% 回帖金币+1 血液+1、发帖血液+2▕▏升级条件：需求30知识
【等级4】25% 发帖金币+10▕▏升级条件：旅程≥99
【 Max 】1% 回帖 血液+5、发帖 灵魂+1`,
'『任天堂Switch』灰黑√': `『任天堂Switch』灰黑√
【入手条件】咒术＞=20
【商店售价】100金币
【等级1】2% 回帖旅程+1▕▏升级条件：灵魂≥1
【 Max 】2% 回帖旅程+1、发帖灵魂+1`,
'『任天堂Switch』红蓝√': `『任天堂Switch』红蓝√
【入手条件】咒术＞=20
【商店售价】100金币
【等级1】2% 回帖知识+1▕▏升级条件：灵魂≥1
【 Max 】2% 回帖知识+1、发帖灵魂+1`,
'雪王的心脏': `雪王的心脏
【入手条件】旅程≥12
【商店售价】180金币
【等级1】2% 回帖旅程+1▕▏升级条件：消耗30咒术
【等级2】2% 回帖知识+1 旅程+1、发帖知识+1 旅程+1▕▏升级条件：消耗50咒术
【 Max 】3% 回帖知识+1 旅程+1、发帖知识+1 旅程+1`,
'丹妮莉丝·坦格利安': `丹妮莉丝·坦格利安
【入手条件】旅程＞＝30
【商店售价】400金币
【等级1】6% 回帖金币+1、发帖血液+1▕▏升级条件：消耗150血液
【等级2】8% 回帖金币+1、发帖血液+1▕▏升级条件：消耗300血液
【等级3】10% 回帖金币+2、发帖血液+2▕▏升级条件：消耗400血液
【 Max 】12% 回帖金币+3、发帖血液+3`,
'『户口本: Lv7+』': `『户口本: Lv7+』
【入手条件】等级＞=Lv7 灵魂＞=1
【商店售价】无
【等级1】无属性▕▏升级条件：消耗-100金币
【 Max 】1% 回帖金币+1 血液+1 咒术+1 知识+1 堕落+1、发帖旅程+1 灵魂+1`,
'时间变异管理局': `时间变异管理局
【入手条件】在线时间≥199 且 知识≥19 且 旅程≥19
【商店售价】100金币
【等级1】1% 回帖金币+1、发帖金币+1▕▏升级条件：在线时间≥999
【等级2】2% 回帖金币+2、发帖血液+2▕▏升级条件：在线时间≥1999
【等级3】3% 回帖咒术+1、发帖咒术+1▕▏升级条件：在线时间≥2999
【 Max 】3% 回帖旅程+1、发帖旅程+1`,

'白猪猪储蓄罐': `白猪猪储蓄罐
【入手条件】无，但是有时限，过期消失
【商店售价】100金币
【等级1】50% 回帖金币+1、发帖金币+1▕▏升级条件：获得金币101枚
【 Max 】无属性`,
'粉猪猪储蓄罐': `粉猪猪储蓄罐
【入手条件】无，但是有时限，过期消失
【商店售价】1000金币
【等级1】50% 回帖金币+1、发帖金币+1▕▏升级条件：获得金币1025枚
【 Max 】无属性`,
'金猪猪储蓄罐': `金猪猪储蓄罐
【入手条件】无，但是有时限，过期消失
【商店售价】10000金币
【等级1】50% 回帖金币+1、发帖金币+1▕▏升级条件：获得金币10100枚
【 Max 】无属性`,
'不起眼的空瓶': `不起眼的空瓶
【入手条件】无，但是有时限，过期消失
【商店售价】10咒术
【等级1】8% 回帖咒术+1、发帖咒术+1▕▏升级条件：获得咒术13
【 Max 】无属性`,
};
    创建控制面板();
    初始化放大镜();
    变化检测();
})();

